#pragma once
#pragma once
#include <iostream>
#include <fstream>
#include <math.h>
#include "common.hpp"
#include "board.hpp"

using namespace std;

#define n_patterns 12
#define add_max 100
#define max_evaluate_idx 59049

#define step 256
#define step_2 128

#define p31 3
#define p32 9
#define p33 27
#define p34 81
#define p35 243
#define p36 729
#define p37 2187
#define p38 6561
#define p39 19683
#define p310 59049
#define p31m 2
#define p32m 8
#define p33m 26
#define p34m 80
#define p35m 242
#define p36m 728
#define p37m 2186
#define p38m 6560
#define p39m 19682
#define p310m 59048

#define p41 4
#define p42 16
#define p43 64
#define p44 256
#define p45 1024
#define p46 4096
#define p47 16384
#define p48 65536

#define ln_char 27605
#define f_weight 0.000105
#define n_canput_patterns 4
#define n_dense0 14
#define n_dense1 14
#define n_add_patterns 4
#define n_add_dense0 4
#define n_add_dense1 4

uint_fast16_t pow3[11];
unsigned long long stability_edge_arr[n_8bit][n_8bit][2];
int pattern_arr[n_phases][n_patterns][max_evaluate_idx];
int add_arr[n_phases][n_add_patterns][add_max][add_max];

inline int calc_pop(int a, int b, int s){
    return (a / pow3[s - 1 - b]) % 3;
}


inline int calc_rev_idx(int pattern_idx, int pattern_size, int idx){
    int res = 0;
    if (pattern_idx <= 7){
        for (int i = 0; i < pattern_size; ++i)
            res += pow3[i] * calc_pop(idx, i, pattern_size);
    } else if (pattern_idx == 8){
        res += p39 * calc_pop(idx, 5, pattern_size);
        res += p38 * calc_pop(idx, 4, pattern_size);
        res += p37 * calc_pop(idx, 3, pattern_size);
        res += p36 * calc_pop(idx, 2, pattern_size);
        res += p35 * calc_pop(idx, 1, pattern_size);
        res += p34 * calc_pop(idx, 0, pattern_size);
        res += p33 * calc_pop(idx, 9, pattern_size);
        res += p32 * calc_pop(idx, 8, pattern_size);
        res += p31 * calc_pop(idx, 7, pattern_size);
        res += calc_pop(idx, 6, pattern_size);
    } else if (pattern_idx == 9){
        res += p39 * calc_pop(idx, 0, pattern_size);
        res += p38 * calc_pop(idx, 1, pattern_size);
        res += p37 * calc_pop(idx, 2, pattern_size);
        res += p36 * calc_pop(idx, 3, pattern_size);
        res += p35 * calc_pop(idx, 7, pattern_size);
        res += p34 * calc_pop(idx, 8, pattern_size);
        res += p33 * calc_pop(idx, 9, pattern_size);
        res += p32 * calc_pop(idx, 4, pattern_size);
        res += p31 * calc_pop(idx, 5, pattern_size);
        res += calc_pop(idx, 6, pattern_size);
    } else if (pattern_idx == 10){
        res += p38 * calc_pop(idx, 0, pattern_size);
        res += p37 * calc_pop(idx, 3, pattern_size);
        res += p36 * calc_pop(idx, 6, pattern_size);
        res += p35 * calc_pop(idx, 1, pattern_size);
        res += p34 * calc_pop(idx, 4, pattern_size);
        res += p33 * calc_pop(idx, 7, pattern_size);
        res += p32 * calc_pop(idx, 2, pattern_size);
        res += p31 * calc_pop(idx, 5, pattern_size);
        res += calc_pop(idx, 8, pattern_size);
    } else if (pattern_idx == 11){
        res += p39 * calc_pop(idx, 0, pattern_size);
        res += p38 * calc_pop(idx, 5, pattern_size);
        res += p37 * calc_pop(idx, 7, pattern_size);
        res += p36 * calc_pop(idx, 8, pattern_size);
        res += p35 * calc_pop(idx, 9, pattern_size);
        res += p34 * calc_pop(idx, 1, pattern_size);
        res += p33 * calc_pop(idx, 6, pattern_size);
        res += p32 * calc_pop(idx, 2, pattern_size);
        res += p31 * calc_pop(idx, 3, pattern_size);
        res += calc_pop(idx, 4, pattern_size);
    }
    return res;
}

inline double leaky_relu(double x){
    return max(0.01 * x, x);
}

inline double predict(int pattern_size, double in_arr[], double dense0[n_dense0][20], double bias0[n_dense0], double dense1[n_dense1][n_dense0], double bias1[n_dense1], double dense2[n_dense1], double bias2){
    double hidden0[n_dense0], hidden1;
    int i, j;
    for (i = 0; i < n_dense0; ++i){
        hidden0[i] = bias0[i];
        for (j = 0; j < pattern_size * 2; ++j)
            hidden0[i] += in_arr[j] * dense0[i][j];
        hidden0[i] = leaky_relu(hidden0[i]);
    }
    double res = bias2;
    for (i = 0; i < n_dense1; ++i){
        hidden1 = bias1[i];
        for (j = 0; j < n_dense0; ++j)
            hidden1 += hidden0[j] * dense1[i][j];
        hidden1 = leaky_relu(hidden1);
        res += hidden1 * dense2[i];
    }
    return res;
}

inline void unzip_predict(int phase, int pattern, int size, double dense0[n_dense0][20], double bias0[], double dense1[n_dense1][n_dense0], double bias1[], double dense2[], double bias2){
    int i, j, it;
    double arr[20];
    double pred0[max_evaluate_idx], pred1[max_evaluate_idx];
    for (i = 0; i < pow3[size]; ++i){
        it = i;
        for (j = 0; j < size; ++j){
            arr[size - 1 - j] = 0.0;
            arr[2 * size - 1 - j] = 0.0;
            if (it % 3 == black)
                arr[size - 1 - j] = 1.0;
            else if (it % 3 == white)
                arr[2 * size - 1 - j] = 1.0;
            it /= 3;
        }
        pred0[i] = predict(size, arr, dense0, bias0, dense1, bias1, dense2, bias2);
        pred1[calc_rev_idx(pattern, size, i)] = pred0[i];
    }
    for (i = 0; i < pow3[size]; ++i)
        pattern_arr[phase][pattern][i] = round((pred0[i] + pred1[i]) * hw2 * step);
}

inline double add_predict(int elem0, int elem1, double dense0[n_dense0][20], double bias0[n_dense0], double dense1[n_dense1][n_dense0], double bias1[n_dense1], double dense2[n_dense1], double bias2){
    double hidden0[n_add_dense0], hidden1;
    double in_arr[2];
    in_arr[0] = ((double)elem0 - 30.0) / 60.0;
    in_arr[1] = ((double)elem1 - 30.0) / 60.0;
    int i, j;
    for (i = 0; i < n_add_dense0; ++i){
        hidden0[i] = bias0[i];
        for (j = 0; j < 2; ++j)
            hidden0[i] += in_arr[j] * dense0[i][j];
        hidden0[i] = leaky_relu(hidden0[i]);
    }
    double res = bias2;
    for (i = 0; i < n_add_dense1; ++i){
        hidden1 = bias1[i];
        for (j = 0; j < n_add_dense0; ++j)
            hidden1 += hidden0[j] * dense1[i][j];
        hidden1 = leaky_relu(hidden1);
        res += hidden1 * dense2[i];
    }
    return res;
}

inline void unzip_add_predict(int phase, int pattern, double dense0[n_dense0][20], double bias0[], double dense1[n_dense1][n_dense0], double bias1[], double dense2[], double bias2){
    int i, j;
    for (i = 0; i < add_max; ++i){
        for (j = 0; j < add_max; ++j)
            add_arr[phase][pattern][i][j] = round(add_predict(i, j, dense0, bias0, dense1, bias1, dense2, bias2) * hw2 * step);
    }
}

inline double compress_f(int x){
    return tan(f_weight * (double)(x - ln_char / 2));
}

inline double unzip_element_predict(int *idx, int zip_int[]){
    return compress_f(zip_int[(*idx)++]);
}

inline void zip_to_int_predict(int zip_int[], string compressed_data){
    int i, siz, num;
    siz = compressed_data.size() / 3;
    cout << "unzipping " << siz << " elements" << endl;
    for (i = 0; i < siz; ++i){
        num = -406528;
        num += ((int)compressed_data[i * 3] + 128) * 4096;
        num += ((int)compressed_data[i * 3 + 1] + 128) * 64;
        num += (int)compressed_data[i * 3 + 2] + 128;
        zip_int[i] = num;
    }
}

inline void evaluate_func_init(){
    int phase, pattern, i, j;
    constexpr int pattern_sizes[n_patterns] = {8, 8, 8, 5, 6, 7, 8, 10, 10, 10, 9, 10};
    double dense0[n_dense0][20], bias0[n_dense0], dense1[n_dense1][n_dense0], bias1[n_dense1], dense2[n_dense1], bias2;
    int zip_int[100000];
const string compressed_data = 
u8"挑炆氃椦椺檇樽櫠徚峥津撕機淐昝灞梨睜樏橡攰教炃昕瀯炾擫瓒嬇爈樷検悢燌浳札犄憒溌泑摖焃捄淳殙慼琻橿戃猓減橕犰澛犮橘枨梾欪烝当汕曮憻晷溙捍烨晦斥媒嶠曑淯疑擊渘櫩峽扃棥桻椫瑓泼漡歾嶱濼汙滖榩嬯疰幦浩揕欆牜昗壨悠庮机港校抙溜炑梪湙櫙憆挃杙敝猐昰樑淄溏摠磴捑睪晞溜琅琐壻每沃徂淿槰憬嫕灭囏涀峗獢沩掷嵸渷应姲凊数愠欮棒届盡慙畯批焠檷數暔晘常瀟曕畽歃炻欸癔疿摚棉樀杍燘怿曍忙櫖焸婏探濔樧攁歳沞敍溅欱戀炉漺泄懮栋搿愹湻檲涙棑曽灏拊漰榥圿巫搵樎歞榟承烾杁消敇瀬帗抇炧暐楿橝杮棹曭楞榳梥楍梞棇梪榎皿戥寷瀃氱潨恶恑砤溋氇擪棢皕焏毹揸攽眇憼帬旻攧椩怪疧準栀椬濍嵇嬱瘙尋浜崍甬皗炔痛慓燜眐摩烢熏汇炷砭桾憂疗曳碓沲珖盄泛噍搋礜昩"
u8"杻壀確桁為碽盝槓敥汩盰攥璉曐璠峼槾煀毩碤暈祡徠楱牫瘹泤拱礼摏欷淦瀿燹疓秩炑琍滘盶瞐漏碤惢巜檫梦犉攜殴斻瀏炰开姦彃痚永榴梛從様獊濑榄摁氯柹廝渰狽嫔攎歉檫撳浂悲瓙温渧癈牸栦滔愱拌桴浕掅怩湕撅潘淬峃崕女沉瀕榖甋悌洮張态宜檕拔眷煝怰砍瓩畵灓曯樼殶睍槳嵠宅熂慑猛棽桨撐珔憟审畸漂槶檏榬橊欷橵模樿橜橅樏橋槂棯屉摍当癧熂瀕姭寜畉巡篝寔犒獛榫榘渉旇朋槈官枣沓梳抌猬熺碯昖樱泾揅殇晧弨岮嚿杣棱片樫璛挮彁椣橧弜揥榧琪璮愸撼歮棬汕暗甽玚楽灪矋殸燬猪旝梆畅抅姥梪扡晛樺朹榾抚屐懶暖湀朠煄熐犧榄殔犓殖畤溝晡嫶熌毷梺氡怯揄敧爸棾曙沱沮燒渽弘瑋涵氅瑏检峿朷璉拦枢匙恜括忰壳撈晥淨筺棊娂濠挘拔檓樇潸挄症楱嬸海弜燸挮栱渱悖旃犨曀攕柩澀"
u8"漲澢沸挋瓸柗獙愅様嶙弓獌惚晋懪呌溃妶欁楓帳博樂憣淔禠崺汽槊日梱廭欋憭楸昄摨浰殬枴昈浮曍昀狢榧桓欮癲櫻挰滥椚榪搨楀棊漓漺敝泌槈橼捳晄汜焎槑浱煑櫮攳檼搣敘瞬癅摘漓嫣沼猢柁戭戕盍梊楁檽楦椏棭槖敺柸桎桮楱杴椮忦毥沥宖税煥暺揙幓濥欞溒汧硤嵕掩狙故獁嶖垪掠潎滌抺曉磐折矆疰帘焄湮奉怸疭囡杨桥徎櫷民挔瓒祶朕惔玉盻沫斚揮瘐炔攩痴庯幡炏沅毅矹庅瘃殮现枆拸敖硽娃昝啎嵸压泣揟箃吔煓懐毟甕栁揸毐涾崣徯桙玩噍濰檡夒烶竨疱棻撡弤滩睥熜璄甖挨東曛柎犊瘙姰狞爈橀榾椐煿洞泡沁圽峁獟猚抄朌沬摲淨浃帠昞瓩瓹混榌疁疞湳浵槃澅櫴燓旆昶暻獍巹扅涮嵓挽猖珔瘡攨硦挪欗槦璁灶牙烿欼嶣孏孼皖恄當棡漓昶璽漉怽氷渋挫狂漾拧噤嵵敔枧煐板燼氨磚揙矙槷榣梊"
u8"横榙橇楩樾樱槓椸樇楞梠景嶍溼畭恣汓恶火柈祬眹扷湪瑙榫摏橐惨疴曾挱炉毙毨灯燣砀瓟濉狳炬溇殨烉獖睐晢戒樌検獁彝掛瞜瑙癣槖火现扵燌巑嵆廻撸毽爁洐盜渓斁焳沐氞橗挘焄片妟媬濼棨焵汋峸敮旺彯淡溽昨摿牍皍楁斴櫵欉玗櫖爷毽琻畽渚渇愞奈濇拪壷懢炇殅淔焴懐幯樍忁浀穛燲拭懡楺洁樳潽椲楼溝槳未瀫湞曈杂昧澕狃歐獒愜栆涢椑寫熁淿槏砗暴掤旕液盝溰恨捜歌栺梏焮瑚浝璱瞦晴潓栚畳瀦灆橻洋涶杮朩湯廖掾殁湱棛珲毵烻朙斔攕瑮泧橋硴濨搄槵牛猺棆媺濹泥擑拗矪憂橆澅楫汄攚堗甭帥橥笞牀幖柪嫒廛獠焆氯砑梨母搛朘敍煌戗曧汾橩擺搄栤柝潴櫾盬曞琨洰硗欩樧槩槩榁柺暦榴槮曜氚桥汙殑汶煏會席盯庐皃洀殟稊廢堆渽歊殝憥樬步朕崵墱媹溹盄晄皔歸厰屛擌殉渫淛沇浬潇瞱"
u8"怌敫擻睛燅欺炳怞爋恜椳竮橴掄滰睭璠晑惵婤枉礆湎澡忏橝孽嶹屡斘矨桙燆瑋湏毥浩楰帳洅昞浊撌炛熦掘樇欭婯溰殿疯汪儘昚廍旈楋浦瞃睊戞栟牟沃暧涑嫼朷瘸攅慑盱濱懹撔庽崳璄瘄皬甍扤沀敓槓睧峹滷泺尺禭牺橻旼撪孫渁敆揂琱涀盈曌档畅璴慮潦獘瘆璓獝尐沛橢摧敩洦椛庶烦积泾岓睢战睚礹擲棘挻揲尖愉渫攨浸廨磠璌濿砃撨稊拶瘼嵎嵮渐栿獱甅晣硊曙标暮桍捰棦櫖晾柮梄楽梍樝暓柝楲橗槬梷狺挂汍枩攒盷燿寄执滥秙烗枰惮榫橤瞃契疭洮櫕岀幾瀝汜快柭徊桂攘猟潩煢疕淋揁盔憘睕砤稳煑曭焯瑝噦汉搴峹櫥澐玼摂昫橛帎奸滢穙瀽烔獛幌俾液孇帵禀棤旧婺扣樻揦汥措甡河璿櫰湤牚珣浒懎桛泶椿孂浺泃櫤己囘漚琹欪磗孵惽礙杖墛拎旐浱恫熉挈崫懼曮淐樴烦寶澓嫙檤泌慚壷琮峕猑榵"
u8"狒浶熗熎柋犅璷瞋栢嶃挞崟當栦櫦濖稬没巉敠坛宜瓻盂搮庡挽汣恐條椁榢旮斏欰槅昡櫢栐格樎樈榽捫燜撄拷砫睫汕璠嵍爽痵寺悑瓢泺挍燙禤稱旌怗栟弐扰嶛癬碩篊疺忣痛忳晋奁澈熈玲沏橝支湎媷睻漣犍梌癣漠眂甞玩痷攓抅榾滢痱洖毌旭硚滙扩幠燾犁梺璭弛沕癶嶃曅擻搐愑炫刡奯櫃堔岞媦稤挡簋扗牂癔帬捽箪携怵渶实宼溘禮條犾槇昩相浬砫砛獅悇田欔嶺碞浖惇悯狭嶺瘀澊牴璶矍满斄御揵恺痓楎秣浍掩簮昇礬怞岹愀稅待暊汷汓垇左柯絛揢猸煪惩橐皷慭犠奱矖慤埧焐席孴猻幯拗樌泺夭撃嵚崹癔癀姶搌幸晰惀濱瑫痧崫抵硏牆漬瑑燞激婹猑灈槚樲媇榺榺榧榑槮槯榜標樯沲欒椠樾棫癘悢矜絗枨澜瓸娲寪梳悈畀姖泔榫狴淇揪曔瑃熲皚毕磴眘条榱惼洲壹爷歠徊枃怍砷檛役牨旦溪旄燰巇焨砛旌"
u8"棣捍梫楏折殙梟焾獭撯癵明悳榮噋巄稅炧栛熸皱戶沵掮崷猵睗浶澩挀煁幰娴燲擀珊硶硆汖棎眇珼珴惂杜椶叶搹慃樚憰焩滃峘夾囷寭毩橹瞾瑨珆捗廹町眄瀿瑶溗瘤眞杵水瀧瀜榎掆熙感皀廛癸氎最爷橿泌峐呚惘璏朿圃玚念畬塒暶涷熵斔岅嵒廧泚捐槝浸烙监烜次燢瑡玟璯暂椵氬撼旳枦毯檕旈煬瀨甠檍璗搣澆浕旯瞊暠槨樢汧枝樉枪拠権槸檂椘椌枢橎璨煞榁牎滛掫橇橜弇弘悼摗皿捐獆灭惊戶戔嵳孅楍泈瞉畃眲爙桙渊猖璽歭朝瞋磙搓廑睳歙懧瑀戒橹囮歴珵傡眝涰懜捏漗朒溼榈槬桜甁晎獶巚森滉帉橴柈斷幵攌硻峀痵桍氽斸峉暚癀峺疒漪拍痙檚瀞灲怔泤戤巈梢玤瞕煟忰擡煂煶睞氖皝冄慍溕䬺渳御廸篋慼墓惜姒漪祸戇獱愞刢毁疿惉愂樾峣杣屢惬彆櫺檚歯暆斩彶穬拘璟對屰珸盈浠沸晾屿梅焧擌漄"
u8"汓然沑灷殘矞牨浚揌昝樒漦烽岐皩巸崆溥硩幓碆椻湅淕溧慕婱峿犊槁抯睅炪玚搒畕瘟珈珪庎奫熬毬畘岰病楽樌楬期梩櫔楍槸槔樭槳檍榼標挣盖浚満梾波溳栅旺怹嚸澚恒烖榫淒勸效悤捙灩瀦暧抿涢宗癕烅祒櫱拯櫛實撝潯惐瀣媈曭孠惻渪爻疾毑硇塗攆椝塟弙堮磐岵昩然桒澹瀲爢宴皂歱槮憕柋峨摨熐柤晥暙娻煂淋妹嵉瀬煫寃瀵瓌煅嫥擤泯揙摭樵晌嶚欏璀姁疤瀞瀔姆歳捬祷犥嵆娦摉栩既刟禉户恎狩柺瓙楪巻望拲狦杪毽漷楋抵瓔宛睚敼媒痠朣氦忦扞瀒疪弫嶯獏揘擽拕湦津执摝点皗濍涽皰眈帏旨畺樹棎桤撆瑙晦挥挵珂沽憝梙瑶潥歈澾牨瀆玃庤淭濯痗瀧瀗斚忛檀灬疧眗棋癩濻湿氩嶶氧疒濜峥揖擷皡猝厙慨澙持援睊慬祁抖嬉瞕杖梛榮油栲楹暸槊橑槄樵杘杪桥撙妮糸搆犀攞敮揧礡柄歏添嫪瓖愚"
u8"摀洲昙灉庶寺礧晜疟嵤埪捁橬忳漌沫憖湂杷幘畨燏灒琧嶓瑩法擭砩珘怽滭崬奼滱弈氼焺百珂榤爏番櫀暜娿猣漖崙奐渲暔弰姠搐忶猭濠檅燴掲抟挟濌昿桅瞻峺欿悔碇牃宓拶牬撈揼濆昭堌晶牗渗淘彗搼澕犟寶撆昣媙歫怺珲殒操炣浸指宬畐澭理焳玞椤枴姵斳巊撇硖憦柚猽樅眧横岞盕泚敇熙朎稨爆禔孇燞盓掤检琁瀊猃祙毌暦焷曄穼漝睚暃榚櫰斞眬电煟塙慈杖桊涔埊渪玫浣巭志斯樹熞徚愮特捣棾焤犊瀒幭澵癎槡浤峕挫暉殇櫚槗樥梽椛棰檄棵梃槠樵椺楖琇烑屒硐庄嵴牭寽棳獥暕滍屆碍榫琧犂恵救栿楙棊桰祵痮帻璲幷毷濿浯爈熏楋嶺眥濡壢滍拔檾洢煃犅孼暃揅李榛玡彚峿燪栦攈珠洡戍槵妎漋硸揝呜梛梞朋怡欎欆暼瑖挥產枽楞溔癒帏枼浕樎橡畭搹敽朼璫祍碎畹悌柽廁媬氇橋漁嶖畐烱慽眥樱尵"
u8"溡痽溼彯欌嫓揄寕椆焻幙息叕勉悬甮樺獌弫嵢篞盤漴揪弲屇槝秃燷溜盹批濘旎淆廏樿廡熱瑭攱然毦涗梆惯抓撫瞩璢瘎檌緙槠浱欢栗瀍狐瀷旪敂惏田溳毰攱皎斟悇济橖朗欈擿横揑箲絼格暢喦珺徳劦宯癷浛燲琸砬嶱椥梽捲濪曲湣渳撈矖畢桡揘挆煾希磼怖檉押熝烳棏渻持晜兏晰嵬忼牭洄汬惧旧琟彼嘜廝崁寳噟劸樋棰椫欺梻榌曘栐桩棾梅標樺榀涽玺汷栲愪櫄嫙槣浶斒撡屈果灧懻澷掺矔栙寲嵈椃擿澋瓊硖散甹殻梀梭煼柭忉窍宸瀗氥瑵每悼娇旽摺溤疞樊疢淀尘洟玅曬砽疜漿悙淙晴溏嬓歈欆汙橹犨既潧毊竍枲早権猺瘯椺痆揲廒癱摛玃畍浸弄燖戟爺柈涕嬐氟够硱琱瞠栌硼橘槲協噽犛庛皵寈棨浸澧愜洡囁点扞枯濒寎曒洉抾疼橧淠弢徾林掖席汥屒疄申緲徒槣孙皑稧巪栤淰櫡瘧峥恼睼癹磾猾眉濾璀"
u8"歀崣榫旇嫒姕殱晨枿樠娋睶嚑揥曅滽泰峯璜拟禂烪枢攵徲畠奘潦态晧於尧妓淋撖涏湁毦眳琿窗瓜汸焳榻榵椸榝榔樱棲棫櫊棴榚椯榽樥煢箑扈緃奒淟洂暜稆收碮怊燝斟榫綏撘泶沥枈烍灻絜屨朊捘欙碿欋洭扈燾歙澿愢枥獎掶汧憤椘戁玝曃枿垳娆珕牚昽棻牆峉徏疳旙狚崉杹彁櫴爕澾煰噝珵澅爆瓊獯旖狧狴敹燬眹栙燉牀栮甞玌环竮犩皳畉横爴徙曀恴玝挦溅瓘珏樾浏殅洶奦紉杤璿箛朥时攄巒椙昰栋漣棔汻爷炿滈摷擲敔榣熷濝撲狀簌牑滈棹帡抪橇瓀灱漱沼撚惪梭炾懑煴涼帗窕漜獭熵浒岩梑嵤猽犪櫨楘睆徑杊椺挹灜槫櫡倕犃撶槻漘暀玢濝炔泬洁梏爃毤幀憈段匑嵯疹䶡浕来捵溚毅狛湄弍橂淬朲殅婝揄潭测澆晗槻潈掻皃棂漹旨璀棡杯痶槨狒枾楍瘰璶牕忍稪撧柩犙昗渀旆滏槯湡喬嬵德歸劮攊悈琦"
u8"瀻彩爂甘感猱渓欧滨愗汫搡甂庲沰氢擲洘浧崿砝巛爋忠啉曭樽渔澍甃渨痲捪玸涏畽眷殡疂梌癣斕焤狗樺煎溌瑝棟晐業濞烩朾栴梸橈柯榏櫔楞棬正柌暎橓棡哰惕汪暶崰沬楃痘沰幘奂瓓掎氇窴旙眈尐斅滆忊椂汕眛孴澼灆甼嚌滰樁帎擛疄即婬砨捅櫧痧澼炮瓵涿瑠曽渐毶掺癒泜碡帅嫭摢瑉檐慿獼怚爐槡抺糗弁崔猀弞掚朆愤坕忇揝枾拤瘷婣庥獺椛拑抈檪檟喨屭巵筛潶梶朴流徬梋柩晿潕擣熐姚毨渼滛孝撕柷晦斊䯝燥摎歓槈澮暢狨猒湀服榋徉沇畻壴尤湐盚癩甅砕徸瑆瑇檽点硤爍旇懗扵朳朣泡䷇嵰潗沆數撈泊柡楺炃噘段牰媂猣樿愠牬扗瘆樴竀懡宰徲愬犚曻瑢擼璳潟左廎敄洮瓳瓨璩巭晐泽欋庅暀犧潠牗琿矺燖挕樍樫橴樓條櫋枂楞枒楰槓棋橯榇忭敐湯朓渳奧眼祋璌欋娕碑奱映榫毘榻汘烴毶渿灀桻"
u8"瀜矃敶璏玄燫戺桵牾獆杉恡烿男挮咪夺堌洠噠扉弴恿矌焓槺攪庁烴撄搨搃奺拪氣為昉斖後炞溼疰攋焆玗曺盋歑櫞娧湖敡渊敽炓搩旭亱歈浒沈潓慦瑈矸恴崔璑搩徃楻伲怼泮倘曐牾捕梶炊柢燥橂癤獉憔尘剢潃奍格播湷欷濊熱烖櫣擠犳潯炤焴柙碬揉猇旰涯嶅椄獰檳湉滃暡曯枓焚敷珂懎扽檥烘旂牳槶汔矸徤嵾戣暬熁梙悓樷渷氖江櫹簉戀慵瑂箴挦漞礧斲熚牝扸姾撑櫭玅珡廜恤曈絾嶱烱徊溻嚩歑捼桁挖渳敋琵攸核樟淫氭櫇楫烓拠攷瘕璆朴洌珋搢毹揪掮奋痕璂淖揼擧瘦朌椘狰燬夤硓汅枾宋珂梥獍狯狙熔桒伀珠痙挖式愸橣燳濞猾橵毃勦檉岬惽灚敻挬疪普浦痘揤猶熣式攘栵湋攍甏楆瓿朎栛愋槞狩澙渽厩捎獜玒煟嵧捨槂棞搽欢楫归嬝栬樒櫬栛榃搗析殥榲横榄敾桟楇杓欬曓渷灶憫晆擤憖疤睴悌樚烆"
u8"炤畤瞄嫔產惑瀪池睥岠徍滒幕梨煀灀嵹碵獩洷猹寊盋橴慂咨姏梙峥囊狧殖煄硉澳屍旷撔嘁氧淘攱洟燯柅斤濛昁琚斖璣炰灙灪彯旮庌煴沀従壋泠槜晞沇扬忥懾桟焀攽窨瘹槎瑭怹癇濖纠张猹挬扄堡妔愃橅皯猜痾昐椃柫熶扟櫱揖瓔矏巰弛焹疯慗崚炥毼崬惽澳枊煨彮梄曩旓烗睥崲撏堷楳夹矕怚堤矜溦痷庵屶榚媇嶕嵖憄嫾稈枟瀭攪打煦滽瑩巪扅婢烗囦獛弸湇畨奸湳璬炑淗爟烢娋璷矙恃淲曄畱濔峋嵢摎璽杽猝欑烖椷璅狡媕棈椯欙櫼棑樃櫑樵棨桄柭某晓橸樏扯撾检渟磎媥曖故湶灯毛汬挅扌榫扌楥痮潞惭痄扖椠渦愦撍栥槃瑳拠搲毲挏汌征椉灴楷攇瘀梇歔漀珫昐槖浼椉旞櫡沁憅樌渲欇棨湉嶹梮栍嚎才柎汎愀檐柔嶧楅峬漘櫿洕活盗橓櫄澯犱樂嫨盘戒熍灆槵棕悱焖橝弆毦欽涷枥榭灏榡榝曟撸彾嵵硡"
u8"溽朓汇滕次洱渄懞柞殜摠檠瓐栉棉揓歩栌洮湝授皜殟柬儰欟煾庿欒撸狲捍犈忟榱禨梿椎吇汱慭妡椑涣猉棉峠掃渜旊棓毝槝槒痸日庂嶱斡欣濦抲璧寺璇泜惕氂榜爊嘻泟渦崤睮斯爳弻爁朆挤燊湡慬嵾湃皏嵱清杶湮湂揦宱时狳澻焟汷尞櫐抉损捎柘憙沏濃歿狱惃暵橵畘恇梊盲欍櫑欍掮母旧牀果旭宬柍栬梳梂杣檂痴惭橔恻沽歵櫢熚榫斢曙皤棊瑿澏橥橂汌桼柦泪竎斩杜獨移牧淸椖曵癓庥撛煁揹槌氵渌曟毀攱瘃柃瑴曞湋洹牺橼搻留梏抷珓癨暉欥溙毢毥槯橥槀橊棶梵楠棟橭榣毦槜有昁法宆献炭瘋皣屛焫嵶眸橡循欓泬矝洈極棎毥搱瘿煄碼滎柫涯并嬅璭揫盦瘋烓椲怅檮朠岪峐痧浐甪晅款崭宧拻瑁珆榟幗柈爫潢曙岖暤砒捘椞泒撃枨幈摋汬曔畡慿昃挦櫁旙稈敡烖氌沑煏瘦汦枞楶朢擐毟犬眽焴棓懏搘毩"
u8"暵慴瓃抂畣晀攄捤抪岜椺浹甚灠殳枩滛教憬媶抟燥瑼淿砷岎牐悡挡熊淁浄琘䴴澻疐枖欭憊眼桇尲慘殿孻戃爛寿眳浌砏嵦燌堼抲烌猇瓐甖庺杈姤櫁璗施憦揯燶紁率棌塔毬濫猇稻敀淎偨屉祀縲沽州殊惯攻憟症朠暴廗溡峭码柪畒灝潊湧涝欛樥杸橏楮楗槻欜榴椡権攤槬棸摷屙忭婱改栬恨巣慿憳挛濡浃籲榫懘憳掐昛攕渮璹榎滨坨嵎歲漀咫泯惾燋有冦波瘢檄碢氺夑嵑彑用淦準昵岚换概弥淀畃欗曩濉攅瑑猿教弼崖担坆庩滀弽揹媼弨珁瑭瀬椟懱掕掀曉拌疋垖箈殦檵瀕楰挷旬箶旮槛櫒峐栻狟殐挵滗漢渃檴殣桑炍爎婏浥毗烎渦漾櫷炰梻峬琡燫泑摫槂玙憳懐洩敏撨措渒湤溍橃沙癛暫桫扆擳槢燩甆掏昍畄昹援扁恽灙熲攠嫻旊樊旡瀎拣橂矅寭痼昄檫琐穅珋滛瑺殓沀憱旖抑派禹甇滱掗摱旭禵洆扎曑憵欼彔"
u8"歎嶳汫橀旉歠焪暘怵渎宄洲汯珄採斣牚燮戂擋橊撆礳硣珪渧歹李愼彗畤欦焖櫡畨爫漄牥濗柪挂烺攚浄歘漐淢渱暥洓怄憦楣涻斃畄殪栧甎珅潭犺汒猾怕熅旙杜弌桃潉洭戸櫶琙榏眫尤曚徴痂琁斣旼樌庵杧棖杮櫐樚樺桟樇樉棘熢慺环糣犐溙杨儰玫檳斩墴敃庞疍萘矅涼撅痹秩廿徃廫糖歀歲宆帚宽搇悘橃焇宫程潏梊湅崚敵櫱棔眞昂禼獴猸瓺玒滛挢峒挧濬橽瓹癇痨眅熑栶歎瀟岈嬜掉嶁欑廲濑稼梠埏眉嵟岷晇泘榆搑瑀砆捝挄恽擩棾朌慚曳慫漭盵廻囻炳氕寞瘪嵧昗揳慙樐怡椄懆洢灮瞭巢圌儻碪廪杤壃恷摷砿捸昿嶒沭婣燷潼斀癞䰴炅忨畭孈攁熛树恥娬帊憕火瓕煉枵氘瑺燛矍澕礪掶活哚曂獯帶潳毶哰牌抭痈璀愴欧泘礟皭桍琇楯擆层枟檶晣洖眿滐慚恻彑琺噅牑攥灧掑嬿码磀稭残沷椅涅樅榧汒榴旌榍"
u8"擝榇樍暐槉樮搟扄瀑礼嶆壎笽獟癓眈嶭杨窊盹榫挡烨殞憮汐禬琳杆炔盫琥檡物捻殥疏溼涬忂弢塾潜抺欬毬瓩檈橌洒涊絲欞楥犃澾盏塽懜棈檅怱搐汛樳瑲抐柜潚煌梤痆楘挦汎樕標暡怭璔晥粥殿曐矊変栱涪敢掹歩岰朆煯瓐瘖椑溉溃焜斍硦廖滷旅瀈桳淧犼殬炝猞痉桻惔渵瀂桯梗氲暥玂浾沗柋歃疬摪啋洄嚇嚮妎晆欶柟怣歘毛数晏柠檺梇檆滝秌氖湤旖痋探瘃潻抴晴毝瀋牯掐滶禐癄曗槆浑泾灔毢殔明滀瀊歄旻挃巤熴烍捀檑戩癁嶎撛接焫嵂拲欛晨嶪理浞愱烳燲瞭櫑椪滁凑礩清温潗湌殶爺敱燽溈梑澕敥擵暴琤撤栙旊杙榚昋沅玢搧嫰淸焚涷屛拎洁溰汅濽僈森垘晬徬揥搐掏檫溱涾撋慶媤汯更榇桶瘑愑猷玘澗曐婲桃孋撻宂歡栀暬檳梸壭嘂测璡熶橭瓨摠烿污巣棞曯琜椧潺溂柹暉甔潘悕煪檵湴擣殩汫杔"
u8"槂櫵槣柝柞椤椺植樤橭晦柖棭榔榶渦憻皳懊皫琩湲拱怲恑晬橕玶汱熖痚棔洽撐弹戬睦欹畉摰棢柵砿奼埇吼疦昴棜獩獽疏痘棖疸嵾怿忻片岸帚盕燱瑸瑧梢復疋懪眲穙樀柽泚憃玍湣炩徤画櫤栄椢牨甏爄濝栬煖廷欙滪廿敎眘敞溾潱徎枌淣愠櫑熺浝噸匡柔禞杢樰牝壄煋媩睢搚痸炈牖燄妒坆涬嶎廲涒撢撹挘掛疳烩洺澁嵆廈濭桞渮渮帾溅湳棭瘭巃摠汄弯筜捳浓橧暻涁瀥槓澔淗燉忢櫷病檐抗曩恌牷望嚧涷柂瞺獺季捤導掹犪研杮琗痮戛栳壪掷炈挊橵柊榺瘯惷漖秅杗扄樼滿慫爋瘲怣洃琿滇屶漐寂棩榁榧櫐槵榋棃棈椫榳樐楂橶棏庍皂洉擕璭宖牖毁砎晫婣溿斦笿榫嵳虐吣疃扊肖縡帾梲樛榬楨澄彂籟湣緑夈猷囸芊衽袯姇漶䮏据竇檀櫻樦槓恂嫫䭐羓榫嬅橂熐垨咶炴犩嚍楊歼曞旚寋艨絁翴曞榨帼箬曏掰亏"
u8"絟抑吃墤歚楿溾桻槊瘵偄袻煬榫滄蛷熞兰牙砿侇唞樳榗槛楩浰慐将廋俹囮瀆粎菲刷嗞皷峫碟妽粀榳榤樢榠蘒蓀䮑緤榫挕旬恖坰佅現匄珹檧殇毱檺腠渰姳痒綘紳悑怜妺吒傏庍用畄茠廦樠橘樷模僯蔬塦䵯榫治想漄椣氜婟嫝狕埬囮巴扮瀞廜楦栻梣栖汱桹昊尹晟沈朁玳燄掫滪済燾涵撬櫆搖燤櫃咤澯氏杠泧東暱瀇檧椴昊旁柿砹柡棓斂檧渐槚晙煍爷晘昲涧旸炶灞畜椂搳朝樸捳溱玐汖弾擩槪摔渗戔昤悷梠屩沣櫇彡攥籋瘝皂巬櫋瑩慃椠浮垿栔汐珇嫘法浅嗳改愉嚸桟校牣劘渆槛惈幬梯己嶶模稠徳晘惈摡戸歿湘歵昦濎暂疸栅歘毞晰柦捸汽徐摆湘嵞炍孜橧淓忣獩櫖淠皓爆獈琏犸煽揠抡朽棚槛爉敍汾嫆满噇煶櫝瀕峚畗欷挎楀枇欚思瞵殕搀櫶獱熺瑹幹曡玙昲彁汇彊洯毕涠溲洪涶徾栠瀔沗狹盰札煒擎樤甧"
u8"愬夢滦橖滊暪擺杀搽焓熳毇槛桃柕柄槫椕棄沁梔枒拔楟樇捑朵巰娊榐晉栈杷哐怗獐宪攸槼炨槙猂气牰無熹浫扁烋盇岛瘻榢椔济楅烍朔殏瀉歎每碧槹楘潹晘槆堚狌捳焫糁奥囇批檚旆惑狷慝栐攜押暐焛氘幮篊舧眙歬潛嬓梱撥歉礔畅柜枅楚狴楘歺暷濤疁扗燬瘩瀶獃彟崢潺珔筌帓煕洓瘓徠敿摍朲炌嬎帧坞帖婘熙得湯惞橣启樦榠庰瞑敛癟桡淅殩矃富疌爃渴瞵瀁猈睗猙潃數擵澈滿皖珨狙書穽擞甏愲煏欵怘椑盄擈旫幢皗昲熮漇眆煬炘瘴烮揬掓獷烆旐燗惪稯嵦甦悎屽朏澁寯拃曠漼扞秐炤幜惝汿岏稧姳瀢僵烟濤濒璄烂潏楏槴楊椁榡槥梂歨樴槩棿檄欫榀惋圐瓚漲搊痱巻搩砇嫖牥笎户歜槴玲攷浣朲潌枔昅溃演懑珆爊潑暧梂漭捾己滘埧孋沽檿晷澪敞溂疤暅炬歨弦惽湔熄甍攔歗淛瓱派巨妗斖榮榕暂擠瞨"
u8"棷昹烋瀏涡熧瑼旐燯彖睱焱歭痶濫櫥杦撴寠揠烏檝横禙搎竛弾扇嶳嘰咬琕濈摅樈牻橷濒沪替榝榠滨澫櫰犀澡悰桁呹攖果尿帰晾灠攍皋琸浾沌尣欎檄楽晆瘄巉朝暵狿榑櫑撌暷戕幞氊悘幷牫帱寢瑤瘯濴畂润焦幇校市汞悸杞皻漞畸沷漎监洋漧摚癵焦砬濅梜晚担楞由棔盨畴愚橙漆楮橶洏濟樢归毬楤嵍晰氈疲橚炎拯柈櫰滇玃怩櫽檀愢撋栺檨渌漦楰炷棄槍形祩櫣慅樬沯欶枵漕懌掗恆牔杕昍浅焒濞慶瘛幫挂宺疋泒桦梂槸柢桨氫樈柱檝歭桗斦橑搑爼歂棳汰矜浵瘛乜晱昳漼棇摅寷格珴涮眘浙晶浤対嶖浛焍扦奼熕熍撔榅殜熴汹簬堖惯朦櫄焕攻濪掮激痨殀灬瑴摲疩炂懮炔怉塩楢穴椐桑孤检浮瞮灕省旙盡敔湄楱瘂瑙戵戠玷抙旧怗湸淏熠碟牣涤熝淔晤祤潊矝旈瀱攙撕瞄煛睕橅旝稹惆歓眜潔窡槊熣枼瑋峛"
u8"琙廥棉礘慒毬枷渻暙嶏欶濦曙桰啾栕振帎岢婢惯弶枞禸朦拉潪婿瓞圔祰攐畠屴欕獦掮瑏影樊拱泐瀂温殀埽瞹瞨庽淶氓熹湦椑棅弫痔瘶毑幩灀漷楖擛幤烂湩盕歡瀼扭廠懿栕恎狭沸潭潖瑚扗旣汸尝狽棹斵殀樑椥橼涶櫈樳桅梫樘榄淳懢皎淜番暣瞘攡旨应租氲皐怚弍槴橳洺琟拀嶤歿昊樘宨澅暓焑帧玷栜昀歞橦淟槜挒樘焗椘步敬拇琊暅獅瘖榝杋扱滴樀犅煾汛橻灏懕瀢攴爖盈旦泺槙欋洈樕沃滾渂櫲揵偂烱憢沣恥櫐棟櫃槭洖宅潏槕杬桊歰朆慝段焞浭瓓沶橊忍暹熻护瘘攐标嵉疕慑帩捤徜湤槣汘沿櫁獷涣市晒桨烂撮濩朊描征朂櫡毨牴滪懬慄姤榯敹忓玷珿徚欞懛曛畞檰暦栃溇珙漘沕栦殕姾忟溅滊固憓煳毻樐槔暫欱搌檛橠憅沗捦犷爟犇宍昧椷沠濯應断砄懽歮巀朸殶崹楟犺欴戥楫敻旮權濢棖烚死狢杕"
u8"旁瑍灿栀汌柍楈旈檉漆愵暜樧櫨氉毴燚樖楘痟揨枑旴恱牀硲殣潷拂柚甭烞溺珑歒幑嶢瓛榿榐榼洊棥椸榜桳枽枍楄柾棧楈屯牄昴砣瓧峤窕旃灙硢巓挔箿朶煗愪怼柝掼津䷁瀗曄沢珅磡猛挠爖慖嬜稇挩猁灝歓猺湉栬癗崈矊瀎砣廸寂枽挎滭枒圛尐洎檆猞搊暵燙犼栀榿温惬癓恀揗權忿徻激廣濯曲宑泔攝戜歉欖盶燖浓帕湌椳拿椣柶竳痤抍此捗灭娰悵澰槦泫昕嶍彾潚挾擶穳撼楼唩橖旳磍溭獌殁瑪畖得怖忤祍朰攘巪棃桟勬憌樟熃椢扬湀淽岚晛焸潴捩璼姊櫙怩弨獤氵影爊潷瞑弆溴揂炢撯嶬嶜埆捞皂帚楛或惰杘疿檈潽擗畃痯杏夝漑燰栠忸灆犇慚猍嵝火曰珈挗疖暳湸榔憆炮暱湫皘槖橒樕橡槽檐槑櫝榹歜榸槌椌榗槒氭碐巑牮廤瞁皓獗撳柊崨欼柡夣槴枀囮渪熠淧玂硩尢嫸櫩碹県暏幧琵噄欶屠帏炆烞磐屨"
u8"椏琑幱報巼犡璦抋玄疸犬榀楘挜潞楗明涼岮毱曢橭来枴禣碿濧存會盫癔樳弆瓬痺瓿沘唏炛岀桞秐忹瞅梌愘網渫怫橿応槄桝渀硑瞥欹秩漰氠湃樱痩癬抺漤擝棫庄戝悞捍殄疉痏眉淎毵峀欸庄橠尿惾烎烌珶矣槮眿猨恛崤瘆碨磿愤怾壑彼戽夋姧揤彆柨掏搜梳堊燔狉废潜囩棇宏撍檦椠淆榄樮櫦樘棛桎樁柲激枹牱濶庐璝睪獟授尋毯珎灣擖式爭塭渷河桾竹嶪斣徹磪懗濧漖滟婐氥愷弲孽嶧暋梽掗曅狀熺瓺杰奍稱愠廪桽沐暹嶄扶珋櫭尋悮秄痎瀎浏璼嗌抅期秛廯旃淬櫎温樿糭眔活擝惖曝媬皘没榨潱懩炉熁找癑瀓璮碄旅欋澉瓷祇暈歪橩掄泛庂渋瘁撾次瞡獈幝牔树毇泃怨敵忩渆暆杝朋欑砂愕揼抨殺盚搐曠濫梬侅斒敟掜暄盔畖櫄砒寂熈渃戌樜眇渒澪渆歎滯疛殅扊塆榸泴嬭尳槰橼甊擪愉璈扆弃歬渻珣庛悇"
u8"毎棪橔煪甅焆癎媳昈悶檻帖湊弦摬耬檬汵妑焐湃岑无檍漹犪緒榿桑桀棸槧梽槔楳楈棪楪櫾楝洵塹抩廢挈珛忇爩張忎矀摜懥濈摓槴炀擾撐痹嫰琨晤毩濂掞懒浽獣殐毛烼櫦憃濾榜弻牊獣晥嫔沖梕旝渄獨础玦嬌椽晴濧抈矿峀晊煮嫅澼沲棤廇甚捘玟幉穀柁涸彶埞幰岧禁弾尃烤浍槖朷牬橂激棃惤漴攡廻榖獓崮捤碌揘挷甔痖瓁眳扮怔獑盨憇硘悜搑揽夹痗玎狪拏嫕攦椘沷燼夢晢懣潃窱毓愲柖橃炣焆盪恇嬏欫甍磏浭嵣嫐査扟毡慌巜娐濍彎矪渥敂暆爯柈玏澉瞊琺撇櫁曲猫欄稃棦愩枭澧凨嫾榀戅忳擐爺猛敠枬撮悉猝甊攍幞砪旒枋欍櫬欒榧殃梁栎槑椁榃樆椯梼泇水撠妳暭櫗焟洀弰汲碛岋徆庑摥痹浫楴榣崡昘歄攪盩淆敜悴役壎撔柖独撧弰曂榚嵬捊炎枝佖滪摳碇濪棞櫬焹愯洔滾夵朝潆癗潔琥废癞滸囸擐"
u8"澬柘曀憹硠廝糧嵰瑣睕晛塐祹戢希暔瘂堥拒硌灣懐烠爴惛椵悟皹瑴慩嬀瑒痚嶱朏沠椓畝徛岖抰奞媏眅校嬯氉枼礽淂睲巪絴氒䡈椣支燓搊搽匾旑喜濇悏礏巺歀桳琄瓕瑃毶祮擕扌幤滱琁徬壹奷痉峌滈崉涾徚熘盟戜璳斆旃根戓挧旸殓棇庣祈澻搚榪混搦斛更焬癊庚惥怪愂悬籕瀖病癓榃婇栲斪灞潚珩梉榢旁矰暈濱廎椈椼橋棭棣柁棆栰槌槥根梽棂榡寏癚稣灾彲機曳施晣攃怣屉慒穧槴弟泍焓疽弿珑欖次戄硬奚憏意檎潜焁憨漹壦猘弨湛痲惊旆渖嶬漝普涆积帛庡瓋爐歮捙疗掣捐歯敦曷憡捤瘱樋斣砽曣扔瓄申拍牞爛殨嫮灢擂洺楀犭涮瑩懫渏櫥歪氮柔嗄獂掙竔婙殈涸珘捥掌爌掚燀牲橗意睓檰昩暙栅枙潌硺崣準痧檚氙氨溴敇砋球极燛烄波泆狇炠撺烛期廽崙嵠委槹夨焩琀擐槅孉拋碫慞摔搒漟熭歛弣榪恒"
u8"搊戦檽哈燆敆棜匙燢潷柶娽槷憻抇瘭晸峁壜廒獠婚殜濗榛檨愪甹朁泪欧慿抧砱毊沶弄碖梵枍溰拌淤旅湪畑斏煨灔戰砞牱枑徨椎相瓮澉槆橚榩旚梤栽梙欓椗枲棲桡榜梛栬瓄恛庇搻炪崀怽澣姰犠敿獙孌禙櫞朹瘚砩疅朏稗沞枝桖揼柌癠於犜潶焛柾灸懵愫毮疖樘籬敂妝淉朖熜外敘码栭弭枀棡渆牮墂摌敔璳嶡懢柎濱样忷瀛峉殪溷暧壻眫眔瑖槊敨瓺峸墛柄皞埿煯焂搵欥尜檠擡涆榪挞磚晪瑵纙幒皇窏矇矸摣榵搘矡氙導皂攵牽咚悐砅櫊朜幞煘湉橘瀐淰慢擈潮獑狁滶灜李痔瀡嵼甊宲焂牝琶湁毢熝矆昨弄往泳琌漒涨晶浏彙瞷棚瀭溯狖憴支禥欅捯淠挋瓔猝瞪槟嫏廷岦柊檖磑璙溿搧瑘椟挬橲瑯浄畞曲巡壀獇矈穵登注幈抛帓彧畆溔砏楾槵椨楢極槊橴欫榻楐楀楺橩檺泹孑晌撔掁旞漦潨嵙屏嚨瀏絻爾槴氕峘"
u8"拔土盟恵矟引悽朲扳牼烤敘柊旎灦懅擎擆琜湨渄渤植抌渔瀠泊煣歘桻瓣庂岢彞焒岌烃屳犢疛搹孢登氟循咆嶤汦浺檓庅毦廓崃淁懃性撏畉扺恅栉旼痧晦榶懛梂祁渱煊拱恓枸岺寽汕洏惤堰珈痹搬敉暅漁婗櫴礕痂概浤爫彿樇哈抶懄捿掴祚疰洜枸潃嵺歽梋猑欜恱桸疻狳淽瑧廄淺牭汭寛左廇琚椖嫥摢槣朒爚焄惎瀏栀橪棖硹焂犬垤歑梑澍瘄灲次森泒怦歂橦浯岥潘斪畒瑋椈瀜掵杭烋橒拺峲渍曳椂擢括犬欩朐焧撰毤朠暈碚嵿恮卍溸捠汰彍島璲杆暴珑嬫疊牯愽熒傺怜攗拝搦皉猊櫐漻栄夜璄琼拼琎晴嶪溞漆淑嬔栫妬朰挹敶楧槹橪植櫠槲更椤欠樈椥椀槅櫾昏場墏戯敕殈岤擵渣平梤円朢膜曅悢淰樧擢硷奎峋律灂潧硵焨扟峃性炶捶樗栽䩏潏砤洵曁獮怷睩椟灯懹湍妲痀欌濭爙弢皾犁牽梷涘機渷琊柟汪欁江"
u8"吢樣焉徍忼江愵碰悢洉槦歯睉残幑忣歭峯挮炈渰巑後焽痗煇曨瘾歖獶珧換棧屄睇娻桬稒歆槮捪晑堚注栽状爆珅栂晏槨禿湨洯渄獁捻燊濈怒濘淖榴巰減犗榏柡湃硹悲澙庳撫椧瑬嵧堚愖柯槡拤竈漃癃年煰戒坼棫撅既灼睠疀撟相桛挞疞珟撜椏姦泶櫷涘揤潫徰旛榊目熢毸妻梱峋漪扼禭儨旱燪渐愠灨宁囍椴惝廜櫗樎榆榳桼楨樶棭槩榌析椔槱樄灮氕慏碐疎疷歎烂嵴熲振嵩牁玖槴滪皾楸斆慾塍灍桺欎氚渡憻毼揖棰摙弔煓秺溡橖核瀅榵涟嫩昆殔淶柼樝模櫎暯汶熧消惚獁庮浖獄欎洨柄櫂渹济筝楋泱歿揑扂槑棷瑆禇抹灛步歀柰棦発愹斉毠瓧烢槷殧淆朵塎痮橱杁湈屲濩瓽揽氢淩拠渪槰揎栋淁穛楃榭池椸无意懳棇汮緾捬洆滰枴橓氧笯椲渘熷榠氓橈煙犏篭濰皊栴拿爗爈癗淑岏溨帟毫槵榼栒泗斮永岸猥獰"
u8"澪朎皂惛搟枿栯椱椔枝槗旜妜杮瀜晱浖民籌枔晔抗炲油宆扏異殎柙有段牰憲澏檻炣曱旣棏桎毥泹怌掋灼泆礲沙棪搘浶澛櫴汅璙帄畠憷沦极枳囟凶災眼檹熲氚早矟杛懊堨睒斄栙柙尖巳回峆漱棩旀減壽孴梸枧烊瑂泝汏楒檆潘洺彾焂它灮瀽亯獞獻玛敾枳戒犕抸庚熺椿潁泤撟漨妛墈幯桙娪暑曰摦灘憿炥猹涩斢捎樴榝擮汐榕泒煤獅歮楴業揘檔楯撛楛櫞毞旾櫑欌榼痁硟弐尅沅犚抟悍攷濞浑知拙抮昙礇毡滜眎爛椹寸爭殶浳相杼癧堌湎扩瞤崇捋巧畖槒欅娥玪漽毽熝梬扦男沋殄搵番球悃画烁油尚栴皠敫忐湜庲簤泔掹焱皂摯洜攵槳熯皙盳欲挓畒犭榒渌秧浒嵿椮嶃氭琉梦狩撯撠畳滰椉棋幟瑋汯寇愯歟欬汎怎崊睁汵楌垂沌璢滯澳属幀曨彻礴幉瀶狸琎懲溯殳攊幷穠涵斋掞榘扔拡睬扎將汻漂珣皧斯湆痄渚"
u8"欸想捖晬攻禷睰嶤孺嶸杁泇掻禧玍慔眣毛歸滹巬捿恣栤王斖怽燵湡弚曙柳恪璄溅扬涼楬甃沾柶瞊抋潙撢淕榫梊懩烹拺椐槯櫑栵榵橨檯槓欷欘梸柃槪樯揻汇抣摖旯穉煩嬈碔牡挜恃秕家槴总桐盯搵捱毙榟奇懪悻汚毗狿璔沦汼棥熕溫枢旨犃桍妛濬檥決渋棪榁栦攜朖枢痪楄洺掀帪棩峥涌砸撌洇梶帯嬟欋梽歹淿溺熥岹幝戉漹檢掓瞑孍措條抆枽彑懅涸垌刡檇扩炃嵉朘甾恋廅枷敋秛欸廽溧汕橅爌樏掔械淺抹犄搡為求幂汜惔搤塚寗甓孇懨昫杬朜怖测搫矮孝岼毅抛扄槣皵櫼摖琲弓焃楥監崞嶺段抠欤峷瀈浦巺欣棣擴敔架潜欗玭滯攋檉曋版旸彍煥爨火排爹揜瀵獣桺廆涮憘殦澊炶濽産寈檄朠溒暶珜浹椝琺悙檎洫枠泉晵忘帿潷改劭渇笲处嵪桙皛滗弶握损珤晀抓枴帐庖涐橲涤犖忊栔晻棽棎目涁栈漕残熽櫤"
u8"殟樇彮瓭矂猲焨毉樲洘擮戢搰找晦尓粘槦焁曚棧廧忲燕杗歋斤曝灘拼掅灔怦晩敿捭燫榸疩煠柺皑砌楓猷擹榀徖欔栰攺梀恩残徳暺惉懴慍峈挂柩晈根棻棊晾杖梇椺汳椰欸摒樔曢淂槫熣惢痄泟喌慭怐瀏瀓瓺溡氼忠瓞崾缡淇堭瑩綵潆忰崥䵁屁琠塇恔橀甼晧炫帜䝟焳泝捖璄梔唴琢玵犢橉档槃炭牸梙掮撾宥憒溸汣済漙筙猧污穟焋慿撙捉䡐炰戢悀炖曦溈粶幾朲䥶爺皑璶妊剞燢殤揥扮娲居捲灴獪池揜捞簽狯牤滞溛穜獁濲搸澿曥挌怅琿坟橺氠牕峵櫵曺箑棰恭眖桧撡来涯熩澉潉烛曼杁璬恃彶涰瓁朶枇樴殾灺惆珩焹炜皁珰潠猴巕槝杏戡檱暥唴胁竊籔砤皩槩帶巣橻枫攝眴孓惗疫槙痑捚摐淒甹爷搤梜焇湆晐徶盅涌祄殍汚爕懷晡汎昗姮椄櫼榕榩榢杈梨放楣椽棱柩森梅摨有憣慤牓毉抜懣瓇悡嶗癞爮嫳槴殇"
u8"整懥溚涠姗棤榕桬滬抮炡惠檎柢皪樗瀬晷檧汅榜懕烍湛注潭朱姹枮氷櫎廨濩榽氅晦泡汋眮娰澙渵崂涪忢橙淎氕揾撞揧孏忴他籆漯扣宵朼朦楘堈斂島牕汘整剙峬矡樘氂掐皰玓檅滾玭寶掽曐溻桐溮抄掂旌宲断渞揳澉梊术棓掉犬榱状摳水癍硡災疗痒攢座栤濨櫱曛眴掜沒爪璼曲橆旁棽挵撵昚瀬砡烠檫攀彼熺洂撮掱斪皻擞擺樍棰掁掛揖巾浈猏戩濦昺湾爡獜拺枩泇甭湞栘晨杬招瓹掻浟牁滥皣櫯抂戲憉潧掆掎槽椾犩硾幥毨瀜磦掤樧捃殌柍捧濉莟惒冺浖溉斖槞嶭懈嵩挙滅歈汿炲煕熘浡痒灎樰昛昐櫜柒撥楱桍槰梮斅涶狠烽攦泸攙氬液昰弻棯汣歌擂插搥歂玀涨喙畫歶徙悽暯泐怒嬇搏摯敬氂朠椏扇猅氤氿柠氂狖抷煱楔徊截攀溘摴孑矸湡现帻宄換扞成狻槖樏梮朾梅椭榾楈櫖湝杢栂梓椵滅愚拆歎棺泯皖"
u8"瀕旊懷抶痄抈瓃手彷翊昭煐成寪擳甐槧廂槏禱扥斂唚瓚浔琫枒席嬗汜柾掸淨涯玃廅瓃戺籟捼碑忸炴朙櫐檛摴攛怷圅瓊瀼淇希栱幇峛盹湉揑圻敛爾攀烢焁总棹扠惨炗徺烪瑁忛珛癙搲烰櫸癿然海珋戚栅曷幖澴揘沞批涆撞窀橥悥撇嶿竷泚彶掟亼妳洵烋猵曁徹敫癎睥活泭榘姤欝竢影埈恞抆皂壥皲妍橯暧拁桐监碆忘焎姄烣慑浪嘭嵩礗撔旷忪甖敇惲磧洏栳柜烝涴忤潿嬁梨淪甐熎爄摜傭搵濮烖宍梽盕梾憠娓挥疻盆媇熘徸瑉洞樖桶搟毣懨旤樻熜樶暖桷樌樢樨梭椵槉槮榙椒桎棓澻曜擋焗撞戔崅砰汝攮憛渮澫濒槴瞊抵戈煣带恝啪梫檁櫆玫昳桱疁括槞橭渗溝崙浮曌榼澶焖瑂獍疽撟晹搴歺恎棕歁瀜熙澎梼汄浔嫚惜桋濾婂槫洇檋淑摽掽照皅星憻昂朙煈妷流攉珃擙檸撉彏檥抮懑愙眸簩斝牾喪幝燺折怖扷嘶"
u8"敭睸彊椂琤潲熓摳湗柇斬瞪桥崑暯批炣瑔矧殳琄旅扵玫檋汜瓍牽渊玑湉瘨皒琝朥扔湬焢捏姄珍旔戰幾潠氾楡爔猆晲灁樇奔烝椁柡抢焬撸漏槁侫硻宜瘧愐擧樂桲洵楬畔抚盅榤熴海权滨漀扮斊朞畢熣慻擶擌犨猹璮桀痼尪澂欍弖渡涫猔焰燛捛盲砆戬寺杻渡狥渦奞暪懴洜枿濞敹汹焈氙牐玥嵼林条烏梣泻愼漲晿嬻澧漁氾煠淫獐牳煑砏枥津煷漅憅斕牶攬暆敔縫滋幨洅旵栳樷櫪狺棻摖朢揂暂湏沸懱炄樋梪殍棔旖榚枭栝楿橗榙桲橆椁王矖涹摳猺爯漃殕敏摈曔掼樚廸溧梲熵攥晇浀盜濻犐廖爩濬怊澶礒攏暴塼憻撀嵽呀搡溡崱禔椏灯珚栟殓澠瀾璇玝澢搚愥潟烋灯嵩灍搖怰殞梛希澆廯撦眺戱拠杇瓂稜矾珤嶋礠物枎惶廚忉晷損璃度敇榥歝摦櫈椚矆洜悑沦疣犿灵熊椱猵焳淬巾煝畩濚疅嚚痯泘巟康泪璐桵溷"
u8"派扷痱嵏挅痵時凖墱戴犡揬恌県渫汦媳牻燻攔湐拂泏撡楣捯喸捫捰妵庽習夛懫湹幉慟恳漷忋弶廙掟憐煄璈曨热嵖攆榼犷幖痰汒懩槐漐熁嶸橍楙挄瓆慊榚晞澡婮搒擆檐枼夒煇痒淀晍柟兪楉棚欪樬毘槼槄楡橃棇欄歗槥捱悑幡爏婤圽瘳稉渹獞曒喌祗嵸弇槴攰氝想彏沈痱栉濊援暤愽旊殾櫃濋昚徒燢毒攽楲燧摄炟志圴濆憏摻搶犖油潜懞情朋敹淛朦榓揇掽栫敠烁嫭税熾浣歖抗瀕琜旬濛林玁浈梛檅惸扛晼氱毙擲瑃澬櫀曋籓怒櫼檄溩懨攅浐櫅棈檀奢楢毙奱摰淑晷檍濃猪䨧壦柸渰員檢揋榠懯栦恍潛毩暯烠揲樈甝忊接杌澦椉椑坓掁棼灛燞泏望测涿殊篃棔扼桓满樑桅璹桂漄穭眳淈焜氄欸殛槧槒枵桌椾攩投昼湿暯燆桴猡玏桱澽狰棝杲崵媿爮栔瓄桎燃椙恵抄大狙撌椃晙礆櫮猤樢洫盉專炷歺澩洷牕犉烢憺"
u8"琾徰柵徘搼疌歌條毾淫憰溡惝杉琠杫暄櫵溛環櫫攅淮柑緻玴喠煩梎篾巼沀掛榉珀朂妬氄濕呥氷斊楞敐歈戈歿氋替忞焮棅瑧浰瀍揹琘憸特牾氣替捆榤痕撓澘椦强漍楇瘄殎樿榻熁桥湼抐憿琷狏淘庆桛悋煘怏橸棍昭棶梽毄柩歉氕梦曎檸桶樀敛恋氈栞懈玕瀽嵈拢璐溪漂浝溍殌沾楘理曤涋珕畬岩派棑磧痮燆幞嵖掴眼岐燙恘式瘲枽燸忧䳚斫沢欒矔弦悜睜搜犝楹笐由囱眱怉硈潣煹粄泟潾椨牨彞楊病湀穖篬徚灱椛梉煼溠浈帠畡嫾媉湍甩拼掟嶔瘾桙焷炪娼攱忪澐沜枲磥燶泎柸眠毡栯昣櫺櫊庎嶢憩澣沈潲橿獶瓱爫掿怼炰槵掇澽楇槗昨獒洆挆烂擧炲曤杘燏暛瘐汬汼惯晑灒璂犲斨娆献必屰砩瞗漹督潿檟淠漿嬗猤盩玌湗岐慺氖甜惩仯廹抂熸悇抗彏滸媐弟嶧璵朮秴捒璗癥猤嵘晠濭痠畣榄斷癕朱瑎煤檢嵆楩"
u8"椐棣樉檯檜槒楛椟棬梫欎柊槶搮怞憿敧涀災柅爦嵝珎瀛札斍漠槴怗翂睘峙聜呫罾昻樟池潞樺噑糓襅灦充沁寁祚穩熧勓嘗塔樎貸苤槯槁榷槾蔪䯒䬇獆槴猍兖摪旘吏牺展垳槃樖氋椣啰濲淕堡箴穴劄拷苌檩啴枨艦嘃笏殻槾歹榃槝臓哃芾珉槴倁汃垼荅啀淮玆孁槀樚槓槞篊膃秐妋坎医妨庛洃昡禜苏綹懘繜媄槢槧槫榽矯䰉荲滇槴秺䱘枫蔷夥侪羥蓾渁槀枱橺劫噧沌幅玳緸崎瘙墺緑腾孹珤狺澳夹楒欠栮槖召煈疦北槴晌涼浪推珀尼熢曽牓澂烈爆焞癯棕楝殜搳潨归左氞斩橝瀁揯校瓔怗珳月栝欆橗廐楰瓕宝毓榾杈曯愌瘳殱瞇淕握桁烅甖宐檮愦瓨燥炟愮琎狨扶棆泣檗泸揮楬歯泔溒焿涑敠潈榬瑒瓛泩硦溈槠拦晣猿濕廢揅撋撁梔掩畕笁漬現渽柎柄燳戲廮瀫氅橐汎珑欌帺渾啽朿樄欙朙娋旴戱殎歸楏泖濓癑煨"
u8"枕懿摟抍澤殏璦搘盧琕炱琶煊氺狔碽珏沭愄曱捔灍畾揺皋栈暏庽瑋殯楾昆畠甅湝渝泐止獄杩瘲殤掾涅樔牿珼璼氊温慺汈枞杼孀竿撙永洍昛工玳壕殘楩欶捉澰炓抱欧朅揊焳玴焃掅灵桷摱榎櫪炂源狄木昊搳溠捇氅楬掚煙浗曘盨柁旭烞歅梱榙榯楦椀氁沼欜椬澢汥泑梑瑇田帘抭疺寐献徃炮泍悥痌嫡無椊揬珡炞朩淭恌沎涁柭瑗揤瓷怂拥淄曋猲潆拿廕攫徨痼祾廌睡嬪欭晦瀖殹矲瞉洺瞿异嬱惨曥撬歏巗䴼烔焋癲擩刨睵梛洖挒玵堪嫿捙嶠廭櫶塖浝漋稝揰宖畫拙營樸愸殚圱噹柄嬵摘戅浢殄捵燼矻慧塞檚墋捩强擃廒式棖憖峉擹殺琈歯斱杣柃寋瑞澇惤歡枚栠浑瞙憌漌涙皗爝徛熰晇泬嶮柯燦您瑲楈枥潐步朇弸版砙燧澂柅徽榍玵眹牖炡椊敍癎杞擀嵕寢枔搗晶孾禴懸撚昣炱氊棰淯嵭濽櫳棉帙很垹橸猵当濈"
u8"帴瓊塘犹祛炦夃撕庘昆楎榻槗斒椼栄末槓櫏樒档樳柵枡憹塹燕淵滈濍旔墚玢炰揄控湹渗樓暓愶樌楥睊晁峬玙梹澉朻屳癳扥溵濒楲墎璬徕皬忦碫朘焋峑怟民帹涪柫槩栩燁痧庱曛烇杆抷椚暄扔敃礙痈懳瀞烵嵮潐殬瞳攊姐溷澲旱帀癓甃敟疛榽泻娱檍瀎曊焇殱枈漶挙壘巐庈牠嶹毡槝嗛琓祑拓瑺婮灛嚫牪搻眍揊拨曰案枝揔砥恈煿泉嵆歜皐泻獃懶忼媜抻搲浿憃旦汹慥泑椕悛徕殟梑涄搤煟燸犚沔挄琒婺梷捄捺惴憁淔娄磠幀夞捠儁渐焦潴癿敻文廗曟棩泂梾痆旕憑曣畞楦檯楀猃擝瀗瀏毞牯扈瘷撑氍眍歱炒犔滇煤畹犃欻戝梚瘏帝烟潭磥皋澯磫太煘悱渻灹塙帖晹濋榘慼烆焾旫彈廕玑硝澯涭愞溾猦挭炑捦稴敜旵疞殜澘梍杼榹樭暑棻椒札樚橯欉椼橞椣怤挊渪畋焣戦瓌歨畹幍氲牁暗搝瑯桲掬更淵穫琡礴廾"
u8"瀘屢昿瀄斫渧殱峮睱嫔恗愳忴楤熯憦婌瘚甓漴济哺槴澒磒媴憛氜梬掽暽晚榊愒灰眫愊猂瓰皅毋媵斯瑷琍栚泩砶盎沧槌撡挢獟汧懃犀擢暡楷攏樢掴昛毀璐瓍涤榿潫斣愔瘓昶摜奞榑悱暄瑛旬宑滋殔惬敮璻熘挧嶁箃殇珇崼棅欁書碪氿桫楻瓉巁旽榸攖妊嶍磻氀椳婃炫濶悏徘燃歊玢懄擡灨焉玥廖幗淸挕橖患炸昰惎帮沦棜拁猌徤屺欠嶍橥旇眗杔晏磘斚椦幍硰欲戏嵧弑痼敝澘篭师杄沩碮歁撨暫敊珚琇洐簃奤樘櫃桩榝槽橓槂棋汓桿楺樜欱槾岬柱祢怔弟敖硹炊涶测清昤矫斻樓燳浻異實疭懒疭灆炐桡瓷疙娤悽畗欹柮憎疄烧堪橷夓櫠畄烸煼汫愱漇湷滜杫牉斠环梟撴煭文橂情楹物浽敔漊昇欍巗柎杏娉已廹奒棬烧旮瘔川忂痨曂毑娦憋嚅現濍擎暢焜抵幄球櫙湧桭掳棌戙崆姕嵲炾帓拋煗憝序皡硥玆彯擰獥盧"
u8"愣殠磭痯猢眷柀癑皶惇癕璐岯斉旭瘄樊灚懂檇歆歭甊甝摹牄晢樭玮梐晓懰晤礃岶玅成柨泿枬攂漭焋猲弫疆牎泤漇畳斌睜桠歠朆旟搩幝燪礦徢瀼溜榉榖瓩柸硏懡檝渐滣成汴灚璕戳濋幱擽涀潻帩祋挿瀯榲版歒泺婗疟敲欺焻狻晿瑁槠易斐橽捽攥杊怌峤嶽帾燄撨抏朦犳槲漘寗垸測擺懡梙禬扝嶆抰椎毲栖棎旪榜椅樤楋欃歧槬曳榬湰循応柖珮宾榮廅稹懔旁毪牉棐矟当瘘殪浚攇撰炂徲朡憽泂滱孰媎峪抍峍稚栏榎溊汬崬昤捰甧篊痧涆坁巕片笽發滁盓淠珞炥班歵磰敻滵攌憡拹拕憸栅捚旡瀖瞻獆硦涵嵔瀙澠杸気楐甘橿槌暢忹疽援彭曪嵊抂悂怿枡澒獉曎瀺勾牞枒昳檑洽璗煺清樀櫃憳琉硯琇恌归忐歠択璛尃痳姓橶夕垶欫植怲淿檋汎摷柴彽矹熻畮滦歂悙幈犂状档昬澥玉瀇穐灾浲檱瓄煑朘敌磮拸毛朂嵷滏"
u8"擇杁湙幀淖玫從砏疪徇汮紻熡桏栀瘍年枳惶氰撃穄怢槄瑯烉珞戅榵枮爹所娑搟渫岛束樣樕業欮榬梘橭昹榰槼榽榘椇硌盦绥星尤灢搹嶐挗妇睔犆幼巟樓擜梅晆礠槭氲涋湉濐矟礧悩瞾欒梔源棋杓彫恕痗屵猯恹攵忱擃屔猐屍摶柇懿獗橭夵烉灚姛汀彊燀惺媰殐幉狾橰殂囩瓮堶槺楚瑚枉嶶堃撂泱溱悃瓈癑淸睂犵礁焮瓷寻棛檈熻櫌槊擇愷巡矄烪栦癘斨瀌眄恕矲潥坦櫒幓彻擊寍悟娖榏巻栯燇巜态撧惕祌晨疽弟槖潀帳獘嶢濔秣梲掦漆犜沜忂惏忕獼檐憟施熳母栆檨砹礷犙板惼爠磿崒撹棂枬檽楳曝樏榪樔滿楙梬槭楒瓎砚囍掺庉档姒垥晤禂森廓瀼栽枤盵繬曉嘧瞳櫣喳岥澾甌廊疏洍挔瑴瘼妳摘牬暑籱狀炞籡厖氰抟珥睗痊榏禠筽孙愚畫渡搤惝暽瓞檷氀熤岦烮嘜汞檀沂椚療暵終庒瀨搠眅庵孬庍汎滱枔洽嶠"
u8"怎毟撳惐狏朋媸棎汦憏嵹崁皤懶斍庠孒揨浄榚彐欻敛煡歀榃砲婫璩廩掘炧昳痲摗琂瑧瑒怑榸玮盟岯珠矩牋焃穳幢皅毛殯揰恋柫竬猋派真梛徫為渕梚哳璠爀峁磜楝徬袨孂媏籘娕檣湶庿眾湬掃帊煑睡夢瓌淙懓獒硤狢澓揝濥悖押咯楴毱畕桁猨漾礧沸峘汼栈戇禵涓溉摞檼檮檅椭櫈根樭樂槜槰様棝椆桵檏奂攕揂殦焊滘疑禑籛愇歘櫛漜淯樓椈枂椎汬湾焹撜怚椴毥晔晣岿樚狽圓猙棉屟瓴懞滄杣桔峅暋甾珁忛栞扅湩庉熣皂慅滳櫼毥楹汓擳犤朥梎棼桕炮対椄摲玚孏父楝寤攆瑃岧毌暚幛挻塝洐廪漎汳犉檴洈櫦潴懭畻巏怟歊晖朠硔橷氇替暌榥盖瀙浞汭斶棗有戝汿枡狙擛敭娚昭旋嵟甗沗痖滉峉槼煢疷洤氐灧熨湡橋琞挔潓漩榲璯廐柉撜皗睚楊狠挧梺抜璯斫樦检焿漄模毾楃毒牪滲睹帳怟溻敎暔恈律懓瓐灭"
u8"拀獠狵忯泅瑆栻攆獒承戗愋杝榖擅杠殜暒浓桇柺殈榺枎楍栀揊摎弲杄孑庐崮昨欣棅殤搀奲徸戴岉娔瞆恷服湟稙攜禈檲琲抏獴璀獎烅眪旺濰淁盬瘤瓈戫瀞扉岞狅寠抪憑报懀擇犛涔瞄殲巆旄磩廳捭橈徼圃掹圗畲恖嬈文泐畜稚畐尫崆櫲潏涙寀巜痲婁慟暠攤瓤捳媂灦渶度礶戕履捰弨庇得洷摜垌巺孇怱枷瞱嘹屧幓斯泋碗嬳掣懗昢漊摮濨屜朊曌昆牆狿滌拹椧焠快畺漵斧殃崟瞪棧沆悪滬汎捰稀欹档攱帬掻槣淴統敚氞攚樲棻獧熓璮斍暊獯槇氝椓皋懃怂枴栛硗嫊岐獥斂搰畽巯瀸棵戜棣柈甮嫦暊畾往扨孙撦畐港帵橀歗痍疩楨樵榩樿朡椃棉柸槙槭湓槫楩泖滒癬墳姈瑁嘫峼撾氈産皬稒洎战樓晾煁把攳捳挅椧棂瘓焢夑泖矁庡墟狀坷楾硘嫩嬎昀崼愯汓槵揫奊漕潱礷怨璁爳濬昿昸杌汷殈崺玖硹瑂扐念熟桾濧"
u8"椼煺烀橎歃殧牘浅曱晽暦涇氒忱峜櫵琩甑撎济曏曲狊彞嶥獯烉恋戣旮昆猀岐狎淌挆汬搞熄琿愻甧搦恼璔果皏畠瑬榖樅揅氆屴棎湅熄實煅有盽筨窪栀璝爙疶屫瞵涰姴狲泺春桥焪斾楣憳椹疕旲樟愠畀星掦犹瓍怜熱洄瓞媶恡峳皩溰斒瘙替崩熡敱硒於棯燴愚柢碆珲曐徼瀺沲搥揭榕檀機犔榯疿寡畸犂杜摛悠旿浗沘檞掽幞癋碘挍甬懜溬狑愋獻摭懱楤杘榱槏梓楶榣棉橄梽構曳暲檨洵帕崒暾攦拋洡巨怩嵙焛汑奢渂燐湥庨弮檙嫃忑檦敽尼帖殓楠焮姆皃欝懽相悿暶宗捫熟唀汥痯条柢盕惴夘瞱䩺淝瑋嶙斥盞炴瀿渷槒紙曨槬湑犗牊撛復澩斂攅塖峁歘琚槽栺炙棯暭牚曘獗灠狵塲槷瓻暵熦晇廪洨瘟瘈挦濅瑖戱栮憌濤潗導珝琪摬煳嵂澣掠巫憨皾廱棴檂炾洀巟瑚渫执猅櫥損嶚捱忰炿湩欿泼煌惁忚晳姽沆壎炑桍"
u8"旡桚殟嶖崻曂枓槞延昻愱戮娃愍敳攋澧檑幽瓷愱敌牮溺痸狿槨猆溟榫緊搫弱旜毙爫眱狚晁懂欽犖挠炙櫅搕櫱扗憋懅櫃挆嶑筓左廐崇枋栔氤横櫌榥楊椎榀欎槬榪椇榶瞬焴朑澺洀捿湹涋技揅所愅栝澧樓摸晦摕櫐牳焒榊洌庼皇曍带栙幪搪弖澠畃溷暪枔皫扣玕盡淿漪抲栤沶沀提毘板桕檥檄煝槠抇淊痏柄扌樥拓渵梥抏扁煲曒嵆掊檛旫欜曑捵真犃渂憞灻多洮濡涚愎槻槭椴燋消搯抁憎痊涆忛摠樔眸尋怠歘戃崹巬朓焀夒畜朊嬨汓洦斏溸矠煿瑳潬妀犬巳憕摐曔泏欿濛滨猓瀭摻狗欳揈攑炑櫉埣益槂湔慏湠旤槈敔柞瑏夢漵戢捒澾消氖尳滟掓热甧熺桁恧檛畖灒姴棷淛桁旇惂槀欄桹烿沭痝皁橬椫淿扳涁杭恝檩暺湡爖浌悥洫栎琕橕渠搇欆爪烞沖炵挫珁潶梿盄猷懝庱熯湩歑愑慍搱潱携斄榻暚揉忂宲憝燴毒廖"
u8"浸桎标潘烡惏曢沆瓄戠栛楩欌榃椂橗桸棋泚檆桱槳槡橪瀒晚欇戸杪瀵瓗樄抔尊楯拶挹疠梞栃瑺揕瞇瓖椔硠恷怺浺寋毐椉淳槥犵嚕戟疈彍琍燭幧暫枅炨慒砏淋拓恩挭煏煻瞩暉曓熵拵枻皧栘屌弊泩炋捶漀睕檋牻掹欛摔榟奄射沭牁焼拘峯抶欃稵敆樭摎姪熌眉浙甀愛才犌灕恁煢撟焷晍梐惹晪壹濤烞灕暨廫坂恐渔报斠忝槐梨欘狍濱庵愠獂涼湋揑悋掲潗曏戨感斥惺洒柠濟壾柵崋硫炜忔瀹磲瓦瀠祊滥眢庌畖峟楣泎矜晾淩巄懩灙據桉彡洄煰巾媛猐惰獃䲍嵎籿穦煎弜拴欬卆歖爾巡浰滧溫盖崞溵栀甅珜戜犐柔琮牥掲祭椷欄殀楫槒椓樵樕楘橛楈極楮槩廊嶁揃筸扥掔屴巡瓒璨浮沅瀐执樓桭瀘枣妎昣憎擇璩施溩晶櫣洐怪盙琯滙汭琮敞沖欻嗉硹櫷濃幌歭显泐曺䠒濉怑娞潆景樹嵱晴檃惠淆沩瓊檂皿徴樞朌煩"
u8"篊澂犗橀湾沠犤畟搰樯欘抱爚槟牜毷涇楓爕擫瘮槣懁旷滸璡嵬瀣泶敝斅狔珑痽摸忒拓氂燱潺槦晴爡汽渔璌毵眛愷泴氟晫很瀟澶拉穰炕怠湩燕孹殘獈洼犱濎橭斯槶灄淚旻盍槞獮惺埞濢猲熈琈拳炾毧汈旇瓸拝梔懀洅氦漨榡汏穷树沼漣忦橒屻攛櫹榤幅岉治汍瀉珖砲洿柈廬楷憮旗琪挛洓沰惉楺洴漖捝掴桦椪攲嬘濄珨攚湁箵愬煀敘暄朓澕滚忙滻啄暯桼椤応燲歍曪弲潄樼戅猻欹掇毗涮槇幆浄癈橉濋妰擝抽廻椽燐癳嬼梑梂箛淁溪戤珥朥枤剳扣琁秉桂嵠歙漡痓瑗栮政灛朱溸煎珱潤滺決溨搴氶欤揾痼洱猥悻甃昝殇摍椹惨甂歅汄琵枧栀熓沈梚欦櫅樨欅掇歖柰楇汜洠楯槡抾爋宨枂恠楖廢畡坲捙典搐燾槓璬亵圙橴梤氌欀宄煑湛碍楤揖爛殻嬆皕旱燖尮枘捊掻摒烌滟痌渨牨捀激奞渍熇框氘焽畕媇瑌梏獓弓"
u8"嵐抁砾瞻幐標柉忁略浍珯登嵦狿瀔灱癓忸璤忰恄幝帲拘攇疚漺硠夢敎憥愛煿櫢幛矟槌掊溤獡焏晥搳棾批氎痰皕犍犜燶滚瀐榷皏杪䵻瀒滱燨婨慳歛濰拏桠橚嫾最疉玉榌椷檳曺枊榵媳徒狓娽盏擂烨氨抆焄眅琘惠桙沤摮櫋癶曩洃嬢儔漦廍暆摢瑞爌惏喁檉塮磏敾瞥局抆汍暪巀熼弬瘜珩湐忠畇澰浪擇璞癬檎潍秀渱栬瘷潩沆爸惝棇曲樸棬梢槮椪檟槠榤楕栏椽橬漑攀敫柅澀爍檰澙昖抰掾涃狆斻樓槃朩桏満掆灄殙惊巪樅揖涷慈籟棿噽氒憾焄欪浰犦溘畿潾挴森塷昗攔楇癍帥睮樭毋珣婅毎枝楬拙擾櫚敭柣姻暦欽樾檎昍悑嵎漻榥禒抡晈棋滅滊廻岪椊栂殯摵洆泚欯櫇牦癷湇椰涐拀煊泒橐汾砝捌摧挷懱柎沃犖埅姪泯彘嵎煄怎摅敺徜栭曽洆瑴漙滹棳据挓摒柄曰灄濋氆汫橁拁擗潕楯滹淡戙橦曣旟杯校炴棾獶"
u8"焽桕灶潆病檭梕渀梢焵犄怲殄棭瀒懮棭滷沚昃漵李璐熜櫗库毲棄欒沠搎毉溸揎滞湀曀斵獟廖沑眰珟桀幖旟橽朥宍旉徠惘搑潂棆昛擤柈桳暸櫪泊琱煙幘梽枕滤檀氽渼狳檖樿樻旦殜炎汇榌娞嚑殖濎晚掴幫犜昩极嶀岹滊沘榝樂漫淁椺桍瓽欛潇畈暊桍涑炆橎橷畭照炌櫎椿柄挂欆梋滽渫枕沯欖檭汘柀汝戏炬珄梗嫸桹岪楓满敒媊坦猰旖痨欵故忣憝捹摧曅氂枕榨枭檲歅栁枉拜摨愫旀歼滵浹瘡檓爂曣獕燢牧屮帻疜纟囡忝炘根斀媭榝焞棠捾湦沷睒爃抻梇澿眭擞沱毫瀩淴玆倧惟巐狮淎溠於庣痛琹湘杮殊愚梀电硰梷漣済矁皞燅娅燄熸溫炏扽岁滛揱犍樬琒畺敺檌戻梣忧暎澵梬幻漞皇欩扪壸癤嵸烮柤悊潛歇岮濗攵杠烊甪瓵瑣柠嶟浑巹婬楏癈碼泼沺熊沲幄摍淘日株枇溺殧伾湿涪泱寓涚摪癆桡暻殾夌澢愻塟"
u8"琹滚瘫常敶崆嫪朞磆暲癳碯曧屪拽碎时禰壵熧昘拺睁玒朁瀅昚泴涣樃瀙廥琴挴孲早烪癹殔手渌嚌嵞寁殔穓殡涶朠狳怨汼慅炀瓞揢慯峂棲橢氺樭楱檌栙柜榫枱概歌横旼峦疴牪盃汰犂庒幪瞩玒焣狢檹庼樓瑘欝旟攑伍楐梦寪擉択忖氭猞曖疿湜捁狔巎炄摢昀楮洖懿榭燈漉昔檋檺玶棷潱泭柿恵浿狮弈报疴搒晨渻獶渗没杜暖欧瓼猼樈彝灦疆惡擶烬栻栧橀璅琍璼楉氈挗疻潣涧熴斄擏暣熠甁庁据泀猞捎戸種瀆滮梺洖湁暸昢擅掎摆瀑奱桊枺瓂徟惑攇橿狷湥步灪壨炱延瓰攠掦揑滒焳曠琁濉桱櫂梉挖琐炐玓殻曘檱摃珷曍旰眮峯瘤昸徱溾櫣狿畵摩唁氷氊枼椴漯毒焲汤恄歵炿嫮梛庇攝娋淪札楬品歉瑼渘杓湌櫦昷惧湾擴疄斲爘檡忸於渆憰瘔殫煋樶檤椳漰梙污煬疴歷尟楈槭灉櫛燣狓暫畔樋殇泻灮枓濒汲歚牽"
u8"歎晙睗矩测宫散桓炚猰榝査楐很曠猟燙撘瀛磪杳浫幆昉无牜沤現楶掰柶珃捛帄璨昹狛牙厭擖柍稆櫤弾獟掗瘝寏楎弳旹畷扔抜檵潦濹旱漢學徜揳昬娛垁婉株楱杯梷槈欚栞梾棠搾楃欦橅朩樲泋淤托昦泚煯檰痭癮嵦尛渇搵疤嶢拷擏攍屭攸桪硇痀夷砉洇略提珿漊直幇嶺檓尰椅映攭牡曩歺熮崁渥捛疃痹秤稦潍烉祸拪怋悫添洤涾枅痧瑟杳段妺抵栒淑珜櫜澓禬犢憞婣燂楋璳栴暇瑸涵帙梻瑊桿潼桎燓惟楢眄彚庸抃戲爈儮椨欛煊憧樚瀴曧瘥独岻淄沞斴戔珑攡溔挺渁片浬疶摘旳爣栉烈梚姣投料悲瑮獂熲屓攃牎戤汝挋州橪殁爯橠疽砩泯沮櫁浩寅爙獎淛撙昍導楢懱嬁搕於摲幔瘈媿楼枣橀漈嵜矀欣桭山岚庵嶈瘃毦搏瘪檬竳硷憄嵅溂澴慨滨猾澨生瀀巕熿步栲櫢椸楾渁来楟檾沄檔楿格杞溈梈潰方悏淮瀪捘穅"
u8"欶痣宦欈摬樓抇澶極瑵獠檨椡灄旚瞔椗枬恝漊燈湃桠沄獻枅携皥浕擈渚掩烵槤疫榈媋壤抡牪或殤夭揽璷盰庪榿攔撵嫞夼唏畘嫨睲疽摎灪崾惮犧灍瀅滹昋楜摰氊昪澋瓅庙慖寒枂玺惢盨奃涌瑩橻矷洕斬嶵圳沺欣憀揉犑溹憵榀栮歂湵擉桂瘡櫶戼狕挊搅櫎旴敧疣洒污懧汃抇溴泤柚扪橴熗砪毘燂漊將氍栺檻煜橳巺徰汚掆氟怋懮淳懪幉匵湘欷瓮奵忛桽玺檞樴王烢渰殔杔炧武氵廉熯橘灱疲熆璷涞汞楧淢檷矎犳框瑚痨婻沴汰摶櫬常橀沆廋燸攒废獧槣庪榴熓扢吳䨓恚嶎査匀寻幥愌掤棈沶撄巔嵻斐玪柉砅桂氪昪攚禠悂梃怶惀檳幸樭庈娞瞪忕怘怦布墂戄嬇掎瘱嵓滇潘櫃擜憍栵氒悪溨懣槔揃殕忁慡澻戓歠矠槡期檅暥撬椻柳欕樿棡排枝朠欘碎抐烊死睡琈琩璙慨惶律悺沘橴槱桡瑃溙瓷烆濈搀橹破毜澱溆盽"
u8"摏硇拑冱笟孝彩瀑敃暽揮儨炦抃暐畹怕摓痓犕澠洡烿琝磒昫款祗杝峑祟漕硪拴疺欒澁矔悬拭惊曮樌灁獔瘴禕磧扇浄柄庭棕洠禦椕皻瓊煜注哬溂柩搧摞摘材梓綘姂嫭癩崠立咠爁峭烎櫇猜田欽槹熜痻朜毄擼檡枧爍發攢怩嚕文瘨敏皹碥盛潜帶摄幎犇畔睾夤榇息燪屖櫦嫢橪涙灺浗愬慐布熥滋櫝弸熌恼翞嵋滬拭穻畲幚匳庌柃嵊榩獕摨篠祛婋瘡彖惊桰术查祹摈琫彺澰湯瘽沇癔孢澧榰濜娧本炵殭梨橃毜槻樒檋擐森櫟樴权樔汇橤磶礘燌嬶峅幛硱攛套毊禊滿弉礯樓捗憇澥晙燧狡煴摝澟璊捑疜滍燮炫毬狣橲晦榉壦獞汶巡汏矣烝就畚攑愡榰斏懣珪捥塵探汖朗棊扫泼枳猸歰焿姃榆拄碞毠疉濹狳朷枚盧寺扌扲澷槠榱沅碹燢炜焰棨扈泦憍歌洗癝擉殾沉條彑灠撘暯怈寁帙墪漧榱嫢応摋妽型疰孂璑樑淨涬崬伺"
u8"揯泗淚狫漉桯正甮娠犾暠瀧濩珑槙枷楁濔扝歧炕挒朂焝癿扫歲仔櫴欢宑怲猷桗堮浤滓徜洹涸柎楍滟滒曈杧櫒楁熏柶渑檔懶湙浆柂楠瑷曘浾必汾廌嘔焻歔橋澭晽汉枀晗寑滬摒庹底禊溮揇栃歒恼摜摬漣哩攍婬晎挜槆甫橠添珪枓晀櫎栙昃汤橌汃甈汬濔樔濻捍旨檬磇榖抧潑櫑皢灮扄槁楩崭棐痁枥樕瓹玺忛檕樬律爬玨根檃媦璥崔漹撐庤捕瞂涘油玼扮拱槨摳瀺嫌娵澺梳朌慝懀濵櫼忳湰瘺數瓛恷欵攽炎梺庖楚堓梄潈樎毥會檴曼挵春溂暶憞浵憷栃欲畲溕憠坲搼榇桔活椥嶧宴擫瞄橆磬彡欏漜昬獕眨弆欬窏尗洡瞹穒瘎洤掑湗淔攏甒妱敤焉孼汖濤擆檾犵炑抴欘歎痎硅檾忩痛橛甔梩橨瘽槑宓樕盈杣焼浜淤婅濾殍瑫潱捀敩澏栥廤槾檷炌徽幙簵桧疤狪牡煞懖毉槧瓂禗沨昴欳禙短瘱巉澟棛猞朤曙瓝敯奆岉汙"
u8"濈姹渋昞旨撷昲帡殏墹椑狽琤氻氆慸斄灘涬獕夜宅殧瑿炪統灡檟撇娽幢測癙犣神池曎瞞瑆朠瘤砜祟犼濉摶橚澫煳狿梅煃梲楨熼掹珢桾毡悼碫桶恘礵廄暺崐矆娑害氠牛娩氜嗾擫滅瓏烁燢硂悾淓岮稯堸痍杸榫斵権棺檼樔棔擋栶榦檜棸檃撝沪唆篕物熹岳戮圭椌攋盷奐栤樓帳蔷咙簳穓婉褅槄櫱泸歐椟棗穙幍憴眧悺犄嵒偍兪曫睖翥还惺婡檶櫓槛櫋副琮疁䲿樓异肌揸倿縙牼楣般梘榢槌殙萈篩狔眣攐硆秎垘廷桳劻燪忱射滟脃榶榖槊槣凷斃椔嶖樓蚧噆抋堷橌埀剥樏榸榔榐樄紑瀂礇咡巴沃堺區睹坋埮刿艨皗甙恚樧槏樜榬筡哙蚠尸樓埮卑利膦倆猇囿囼樾朧棒朦唳瀾罏搄朙欕矔䢪樹搞為簀簥挵旑期懣檴枮橇攲叓矾嗚樓愹曠柷潁柢扴屯彘柆擹旡澭牫潫滊崷旎濋淾愕敔櫋溍檿涪慷挋椧璧泉泡漵疯抛慌檉"
u8"嵕擘浗汳惀畱姪晌怪柬炢泺樀殶琊憞疭枞攴揧猀撢枆棁疧欚毨搟斟崿爫惷劲愕漙猶毫渵溟涎滺捧欵滿掀紭曕忟幻挆撕杭壺恹泮睔油枪敫栶渞扶攆彴是爪櫹渣现焩毽琠摃濖撚犏怗痚殐琜瀦楮灡潅斑流攐曺町梩懿烦楯畇屲桊彶晱奺暠啭灬碻某曵牅恿彋欤搼渗煣幔巎毶橣睭搹浨溂操懘沧橿彝溮琞楪断帋焭桃梌术瑝僥渁承疐焪拵炯洳痰皜曶熶渊杞櫗權显歊斁拎焧検揼灑皉攢曬毦样澭棻欮直痙揮扰熌掀泦狎悢珬曼歓梶撝毫泛稛疟懳景氊榏朶椛檚橷棥柫料撉枧斬桺櫟注瀡橰歌璱汆燽欣晸椒慉殐甫惄扩润暟彽睐泯瞱礊泤柞恇濰曭檓墹槡燏甗挊欺恗牋熞熑慨瑘瞟抋滆恷暑壅矗焵栘汽立欬烤攳宓残捗掛歇痆涌焨氞峎妳槢沣曃爐痥愪湶灜潱狑憕帺桾砬烂牧燆攌看樌疧洎璔括欌愾慘疪熙暟栴峖漈摕"
u8"痀掠泰歰榈暐忋擱繴潴暧捒爌暾悏崏懖漵抈扜碙瘰挈瘫洡嬡病櫵梳櫻忙溦晤䵋敿朷抱擳檩寙淴寇礇沵搜狹揁搋漄畦睑櫘珨玭擨潷檠掙枸桎抶抨洈湢每巌埴梖攘琬櫽慌毽楯晘惓尹泅濷决嫒弦榬徘歳牟峱懛摗崊屐瀲嵢敫她捾宫巩棍朇欻梅欿檣橜殅殌澧樇梧槇未烙泍洉枑憧玃慲渤敊易幈癟寘奪槣瘽嵌牪潔瞙敋氖攮懹於扃癢潓焼朏梸渵揰瑴炒犏滿涉搇掾峸楴瞤斟眬氍牍曰悉寀淼燉獛毬揗掐年学囼珂疍氛溒涭寡掃牏挥晻棆焵宲柜狣捷汏玺槚瘗斒牘巙忚杓橠畅洯欁弙甸憙漢湃珓昮漝猐挂比犑柩溶忁揜无湰滤甶洷栳捘戸櫬溪杕愡摕睙夦撲檱梚晵恖溳妐漀怖灲狧幕沴濈梚唋榮晛悦燬慳揿擧梎櫏瀇戣嬄柀晍扪榺啣堥澒燚挶瀤嗘懓柩廧橗忤滟椶煝滐慰恱柦欄焕璷犾擻牟慾度澟木掹熕拽廝媹旺毕摼"
u8"怐媏癱椈渻暜瓩澒棆淡栩廕撰殩爿掍拓濝拾此墦戟湁潄璚婂柏洽抯戨泖囟澝珍江殾溫慅珦摠搻攃梶尩烀撨礗橊潢朐怗槟柲模榄棧榃桂棯桰榐枤旂杨欲榎浑橆焩椾橭檋榠殇榤栯盫烏爏弆狕樔嶕潞澟白櫿琒暀疀攉滎獊权椶沱滳燻碢弫湹惝搅懻砀櫽扰焚湘揪滱泯煪旗桔惵嵦惠稲祑瞢歒巕峺灅控媇碔煄妢殃畺拪煃奋櫢狖层烖煙末嶋塻枠巀珃殧瑞敤猖斩砤徕戥暩挽枘慟拕牅撀省晰徙殴甾瑲戉燏珣痮瀪皗戁炔影嬕櫢峟屑溲栐琬欏洇眩盜瓃曉漳摽徛廬泟溈埗慩洛椤甧寽梡弜潩淿描慚檕瀓硗托擹殅绋省玮妠厵獙挿奵澤枎抈穿箾挊捩挤煯槚廆橢珹慎氠棛潫堢生泄洁盦寓琚幖楽泦校磉朠姃滫疺牲憈璉断抪夑忴橱椭梺業棒椶楖樏槲棘柫殔栞樎嶪査搹獯塇歾搲澭灾律枃昬潶攵槣殘獂寘欇歔硫燾橽泙熇"
u8"掱屸柁拪漙柤淎汏歞是溟瓑煌悕瓡潞戫棎炵盉楧嶐沾煀崩獁烉璘檥炛焦焷尻洑猎柹彠湫恹捵橞獯梁擖柀湔櫉献樒杄狟壳移灆檼昋攴柵焮恸漋渝濚瘏扳敿瀝煉嗟潮棄狛壝峠岛欁扶橼浊璉娂楃眅庵淗樉炖攞挄搽痆澸漵搰昉洷熷泂犅濬湡揿檽巈槱皃瓝旝柂暡琹洁敂栻楄幍棐敺樄珈扻杉掮楝潂挋橗摾批换碉没熩枿尽溉梌瑖忏滷庫洟戜殼炘朜灴捤泄炁涎榄皆椕忙孡狥渐珧禣燇帧娕愢焷汖玶瓳捗彸癧帛樠櫓爅扎榆帅椾熚殟溊氪挊盇旨悷擨生柚朧環泦溼檙彩楰揼玏煿泬槛瘖歂烝搨沣恈炷睄灶擀师擪棿橡栕桝棭樗梟榐檷汦歶楣槸椖椀歽甇嶱毚怽矞毿櫴瀾灷嵷曠皦环弎峜唠省楁幧疶忞渝玎皞疮瞻滌姄磡疸媷笰巉琟滓嶌攑揖盔梟湲琍棎創摕撄涯夛尨划慩恠旁欳擈每崎岽弣畘櫌瓲帘愉弄敾槲攴皜帍"
u8"憮槃妑樓禔松灼既痝感擥徦殨珘洸憤楾掭潐漱暠渣斄懹昫瘄焫滜密昢欋浒硚淳授燎睟杭滽瀏簧姎奴槔潯悭獻樽囫嵑珅懸奣栅撳犝焴疅嶓湭桘憠樇烾烜崦洫慜清攐屿瘿桻刔批惽戻擇濳眿樈现癇汏姶樛淑歎棝穌忦消磥敧沊瓎瑣歯椣癤捸弣捫潈濩映礤憷无淕擌樱硱愶狿略嵤撞盞櫅滚瘧犸戊樉棏榐晵椁橥橊樼模椀檽榭楏槓媋桫氊撎嚜曫碳窬涼既摠寱狶煯槣昞戛濝湐璥弣漁洓柇姑戀曀栥燙既撏焍煻囔歵氮磺寿壇燕皱瘺巩晅畊濞嶑珔嵱皼禙懰涬秙畳崳懨姧琪搙窡朇燲硻幮沸攱献孭嫝拀睑泗彠獚揱烬瑀洺瀫娑徫拷洲崍溑揈柲砩慭猧壠殀桻揆浢瓥牭夵塸摐濽禙擤圿彌畬寪曄涝庝欝嬁碍懩慚扑癐煙婍忢壴皔凎硭撞夀硠盇数睮浻睤悙攽癘怗汈欰敎暏懔惍匸燯壁疊帡牥彿氓娝汜毮忕榊洶梹椛椲棄柞"
u8"檭淈汒栎模棡櫾岹擷恏早歧昘瀇宷彟瓄棎戰戭崘垑啊杞峃泆燸唲奱笁洖瓁瑖歘汹瓞懼瞯朁潬忾狹幋海毡玊橯氊挳槕捰燾掂廄籗塿狙朶娑榑猯欵屺皣煐炠檀欐澙檗昄瑆砐澱晡瘤媬痳瘿崔檼洝灶沾穏硫亡惰夷朑濈宭促玼摭场瑝漩扒沥槤弮劰绠揀硐桌盨琼痍烢澛确盍棌拌導昑嬛氎壋盝檺柣噊懯榀懛濊橨磷槄扏欚桝瑸屷百濡朙姹氬耉式牳潷挌彫惺搆殕族眐炩狪椲搝睄焌彟歿孏妧废灋瀚犛枅張树焯燣棆弓灊幇猧狈玮撃峙畞潋氎狗巣寡璳抇張氯烇秒挻潄榧琂屧甫患希炌塠梹敟楯棱楷栚柿樞樊樕椝椌楓檓缮椔埪岞湷櫐港狺渟渀磲璄眱揉槣洐澠歪旆晑槱杲棕旚昭汇甒礪楖瓪峷徆掆挹淜玳噓引旭怫橒澳毹忎瘄敛嶆琨棊瑡杊泞歴懶犩祅瞧浂戴抓澄尻洙瀔梐瑰毥潟癖玢犪瑦屷碗惜淑燒氃愓撞歽璞昬"
u8"戧疚洶巕皴烊焻櫎洦樬抓淡悡棒瘬旇眲榧硧昊徱廞崁戇皻暁烤痷昫斎疛扏攊獹戱嶅斫捗珹禸煇捤漯灬殀泡擎涛璘湊崺渹猌櫋潙愹揯惯欬涤璱杩楸柽撷攠捃瞽懤熽夠墣歴怞唌焒牱櫼愅捨昐瞫埗滁殮梠爨悚洗揲彈炚楆昂煊岆樾玁昤昌江檽殺栳楞桫樆楨楢昬槀椰樋樏燺烲榚洌挿幽清憋扰癅擴畔濋嵂欮眹燔擏獅灍擉瑑怉炸屴疷楻琡欏暝嵵睱熴煀炟暕禐爬涼沉橤殁玞撉戯毊眼祩欻睚妊杓泮恜把栝戜篚皂硊嶶欫橖涣狭楓潈崏娷懟峞嵻樖氊暐嬇影桑媊拣沁焹熊浶欜曬橧熉悁恳溄某珉嚩媗昃娿悿沴巴稾啒嶼掯犬瓬檎恷渼癚本恂瞗梹泱沨滬杖澲孞憢瓾瞓涃氜榹窤橑璘嶪氩瓓盛扉矶矱晌淡瓊栰嵰抉獄屔溋憛燋暼枸樶峆槂婑烱憆栽癡嬏専汙灄睐甽戔灡毛瀨杨澋區昌幩帳烂玱硥楝擃琼皋琒姙栏瀧梟时"
u8"澐於摳痿搇毽燓棵擴廘楘槽楱槐橜椸桫欛橐槯掙橏柼椖庒窵潢攮摕囧暥弮灜彈橔穳曆懍槣尶盙柺獄濊愫瘒渽秐泠拾灡磮澺禵械烘瓯拀焇洢攈澅渼瘨宸夊彻欒淏珪滨瓄媮岞栖涘牃欔汱尮峸潡宱歁嵽甾峡甿棔甦朊怘瘨据浱摡痋嫐洐眺湅惂济浮岏暟煮第幒爱矝撟拮皦崽畗皇掗挡潌榬楯炽既挳欹榓尞棟猳憙慼栰梣徻氁摟抶圵杢掸浳研杫帴毬椽毤沇囫棺澦堬瓧椏滔攢棔璝皹昿奈浍獙悤淀局燧盦抠睅抟焸牁痷灧昍沓歷憱琣洜撢琅桌暫淠棟櫽欫洪忐挛扲瘴拼恲汆矈嶝椨攽柸淙焓玝廐汥歹淈撢焒滁澝斞榵現瓝玜擤牕瞜忣弚掛異憡槛氰煁漱攌潬捒櫍榽暫曷棐搫楽柌欤檭楯檲柿橺櫪徐煨歐徻濰欹痈媻玩疥堸爀欝朼瘋煜捿彬昶穌杯搖媬渾攘寤娖暸怦妖牎注寪昮嫉戠岘皷憾懅庈崓狴氓毌殬擂窗愕玴掖"
u8"杼春种濨憰炦弳溥壽嵸殡幸激峩圫淘泛漆沲弖涛滕炅泙寥正䘘秭州浂疳皣憲爓卦绐瘛櫱峮庭爤撓攦岶寎嶦托榚枓犛捺娿櫧梍愞硤悡皑剕湺环朗樧掛椑幖晏眾睜嶜屛咩疾欅嫩爑玬䨵帎棤洦祱潻楘慯幩媨嬸歔欍焛疁祘浩徻幈奈失獅氽婒惄担暐媸獵渠漪烖敦庅瓚惶瑕扸痣开皠淪暩稰牉楌旑桟峈淄撙媀幸斅櫛渃獳盀櫤猡癿渟招砎滵燪犙槥樞昻横檰晑曨曼楚柎歏棐檀枖槒暖欂圈炟擼梟毘昦婍敛狑梃毃尭槣杇湫矹猝皕斛玏帍椥朢秆投沣放燱屛廴晋扵澞璬张庵形癡桇榻澋朽沅涉亽祪犞燁敗戛桍懸欥祋玻漖慧抣欴慓瑎煻漁愄廀焻熷泂杮惃甀捴懐矽汞檦瞗玍獱旵当滎炞瑁歪窟愞摭椡徣楩溬洇塇寃屗掬嚽挩灼搈皆爐梣嵀渆毇娾晏岣廭碩梓樮烉洍痪瓮杅瀔嬊甭濂琠氼渙獤涶府帰杍焔犇梺挑擞砵岔渋"
u8"慆狥垏挴焾泆枲殌灵本畱改煥壂嶷獾硔榖昃旔珂琡嶟澡斀斺眓淓樦悥畱瓕灾桉睴珏煿煴朒徂糲斝弓獌硆攝巐庛焼溔曧烑瀋睂禟沯糰樝技巍烋柖囥抃妍戲嫻溓摧痳犮榳昸橆匉熦帢幰磰垁攟淟娈敧浲毶楰獔桢嶘撽挅樓嵃犃每弹玔櫜檩榭楹欌椰枸榥歂樞曯槗浪槈屨夸摳司淡瀑瞐慅涔捹烙囊旄氍浰嵜熛楁嵌元搓歃椴涄採庭樔呗爬旨心歀眗汦愉渆畽戵狘播殇樞怍扶家歲嬪揲狻漏椭市愌洩哭彙檑橷煶榙帚捡擵嶘槇妄庚煖崧癸橃浠瓞扬梵湶淽斏疃晫楇棲爮窌婀寻容惼掾熎尩杰攫旗押潍懵旯扻渁匴俆暵晁燖垆媎淹掹矝榨楔歍気獡拫矣埿妣挛涃烝狛泿搨挅漝磗寳癔毨悟彗炖廳畳敀廩嵳槡拨珡妪皼板綱抴爁牏惟挎校毭嶧尐恜憬庇渞漼珀橾焜枹熚景眛畷楢殰硰怢洆旹帬懾硼祯榀琚指犉槕宯抳甮嫹琋"
u8"塲灿疭櫨彎洒煯添椒橢榻朅檯柀棒枛欍楙榨梠氮栔灥瀫柴祺烝湚簈漵潰斌禊憪於嵻槣氩枟朞殌姭眻摚庪睲檊榨栖桜眷庨畘斁徿塶怳宋烣塪捭爎慒檦妓砳夓嶿惏烙椎潗棺憦獫獏姯渚眉扗磪旾牃栈璄睺峮沸旤屋状牫棡瓯斤爇岝沧柕拿焥溆猌甈枢昵屽橒牌斀瑇朾婅杌翚挲嶟璮矃掋愓对稱烎婭殱暎狴渟溰抣愍業懯瀭溛柹槙弘斠熂炴焭憻疌烊曯欁朴滼爨燬璆嵋畀瀖歟溍屹燝牜槽溥愑椴杈桙殧牧旱墮摿泉戺愔扭楜棵汅桏渂扱窿媈濣焅扈段浰吳旾玃俊同筐竞揀犄淉熀櫮尼祶檽榾嚞搱獣掱曠滸煘温杋烩沋掞滚炕池煠澪氚拡熾窨毰汹烼疷碿淬灕张潞東涉椠橝摀濅玎皸瘮棋感敫戒爢抋図溣濬淪岄术撺橒揪擣慫堹漪惈檐杝彳樻洗惲撼益砩憛獒烼帮徭喍畂澛榯坥束氵潟洠悯念疃汰椯枩環皢猙汷汻穳拉"
u8"換掭攁徟炊湧梂櫉灌沜檬溝撂癵套爻槇泄攇欁栫汋柬峵慦殼树朜捦檗溋姏漹磝敪泤湔撕皃攙怃棻疣業愤毳嘮灷惰聉憚潝絲暚潁塧囦猆碝滄戆湣氙炏浒杶旳瑜渜穱柉猠甽斁䡲戇圯嫕栝嬆瞿拿皟搝偖柸檢皔灞憧瘝晉稄剁佳洽崳溬䤃斚炮悰牽溊旚灢才峑爰獵瞃瓆珂柴湖撇甛戽捰枿抜嫧浐毛榁宓競极嬋甖曚憣撦媃琌澎斾慎浝垏犡昃曗扁䠡峴浃渤瑥瞏沆囇塡氺毅恳摔征寏簙犤沰漜拜擦町晕拼忢挰弞屎濑猵扒獔懠犨皟檎灉嶧摧梂摽拵婬栝摌璴琑狪嘛撝恹摜栶焣桥枖帞掮惈彳璱沕盜皡欛炮拚瑔庻䜏庆捚榄攫温娃常獀柁呢瀔桞咕槺樠槅木椤樂櫀桑榤桴槃摰橓梜旒滑徏慆燓盫師烹熀涄宇怏毼珓槣株溂幸岥矎沶漊披楥棴櫀濵嵜怢澀熑炵栀癞浘抾抻僽宅伫氉櫫毩班捉扌暈崭臇擋楴歩涊欖棾狡搄瞫癞"
u8"幓攰爴灳燲懰攄楯潶旝杓湈焏氬橴瀻敒狒渿沁埞术沥榗椨湮桼檵滣涇嶅撡汤滤玖掻毌憎樫濓床濖拸曓瀴癌殸挸潋服溿櫝搆檩漋淜扲毿狎枽挥晬泫湨橽滎漎炄掏渼涖瓳檤津梾棞挘嚦搂焰檄珌杬澤浱櫛扛婯瞏歂汋瀢指浊椵欬挎渉摼璊漁揟柹木漭治暟梆泉捭瑼杶杤澐澱炭洷渃康泦檏棌淍揂浖浚柽渉忯殕獉昃燶楄泻毐泽抩岚班摅爞決槎憣牠橗欨彁畩獤焧浧沜杘汼檄睺椦椾拠祲犬皖旑枍戁榹帇暟盷漁櫑犥扶愈搇栗澬夾拨哠泅杰宍嬕昙汅爠宐煤漱泰湸琑寜栒巗棕瀶楩湍柟泡昉氠桜犅渥楾嶡溲椎瓂猂浍疗嶲犔牦溴晥櫟救桋怬汣懿缠嫉崉婪烣曶沆橍氩搠榠棘椒摌暙摽榲暕潥搋榪沧扊穓燞潚磤椓応弯浢潹摣昣愶怨挸摿朠媀晨瀬檩歍奾嶓坈瀾悤殲塜撋眚玊彩恾掷晆橣爙曔猉榍媸攨壑痆波禌烠喔睌"
u8"嬸撺櫬睂杄感敵烸栎榴挙樁皅涹牥獦托涷涥旰撮歨曗掓澳掣檣巽矷戭皯恒瓐礙打殳栶敠瘚痳朇攷碧榜摬瓉忐未滵濲爅泏揍皉氮漂崎穗湫帬旮烢喕勇杷捇堟櫵兄搐嫁墜灚卺耈嵪淞瀫栓獣燖痦樣沛祏淎槊杠瓇澁焵瑃烢汐憹眞焏灥朦琪柜愎敛涞畝框玧疰梲灛灲庩痵畯法椑烑摾幤惘悃浦擦斄夑痂棷泍沵姵昜撳渄琵擼畫硉癛戛玊嫅猇煽戎榔祷槽櫑梂椁棒氇歾檔楦椚橌橎昉檴懑皥潺瀱生猪爈塲湾埡粜烴溼爣槣憎摐扄渦索文炐燷岠漪済扺拳暳牖洇掩昰搸淊栺烫涐河礗漩涗瞱烐幩晥狱楳服玺文樌瓫榶慈户椣影扖璳忑帟獽瀪潎庪庍惢璾媪琤嬩癱焨焝揿沥瀡爐猉柼憟朂垧硢䨵挘嵇殷朥惉嬚洉瑭氲氘炦歔檀炝瓂斱枰灄柩滨浗憕檾滑婥揨棡瀄烼弱拿咅摗奯潌泛硪抳檈岇恟晴晳痷樿歖磺枆毫矅矈殀擯欶"
u8"椉櫣旋槙烉籞幔楊征敫燌歷忡皾瀐淦暿撠挤祰旛檛突沅撏痗焴帼擋溊瑂槿瓸攇擉刋扬撬栲栮泊梥剪疀狤捇擙濉撁瀒庡梢橔湻盙猈巩张杗峦殉焄樧廚添渢徍桇曫岂獀爐浡瓸榦牒繌標椊瘆穾猊待槙恹汇緺屉惊嚬斌漿掫巙攧嶷徔沙洑栧攽檪氢啠燡屜曖泟烂洏斵添稗暽泷摔汾炉焄琠煦瘹烄怟栛柼炾旡楲戲愧睡渞猂潵敵掣灍愢屎槣瓶竟攺溞捻怒杇户弑橮痖煬斜溲昙櫨暥橇樨檍枯椖桇母暥洣槴梍嬚矌摒橤总䵙嵁簋潇筵狣樾燼玬嚟榟廏廓戈槦婫擐圪樽旗慹恬痒牾矖慻楡旡梉或殧椺敜湭焩擼匈梟戧獵愲溽痢恧帴怭瓘孙嬊潧愕崜川涹湅榤攽憉屆憖懕碊焛撦昉琊峨碙塈炘悈燣燍椼桿昚琺殜瓁曫慌癖妡畼揇棏機戻堛憒岘峣昫椶帊熉揷瀋磾溌瑸幍珞溂楏柩惤璠杸柳欥夁甘澿帛夘梒夗洛曔祶忆拡樸搽汁"
u8"壆礀戆煠潉無朜我畞王漈收橁暣榵捵嶧斫批枥抎珹疪僁徸啬洘岌爄壌爜懻楘峊坈睁寪洢懺煃抸岊妌杳榜监憞䵼楽瘁嚓沘娻珋柆獩殽濢祙櫷整僂溻撃溎橝朕棒曯斐枕榑桭掓柋椸梲暥榁桯噭泙奙宊枴祵焓扻掳曋申朝栄槣狤梀斄朊灋慡狶掚斵塠渍碝琕檗毶珌珶珠劢狘捾抚狃日礃懬投撇巂撍瀇獙居堢挷獆曤泹瓈惒潳疰歵燊灲枳漗怑炧浴玬樱帬滃朒揝漆灴獌瑘睛烉攪枔痎瞉叁枥泡磕廢暼撗墙曩扗曫棟欐櫊栔潉澹珸獫杀守杓椶敷岠沤慚擶焦痲昞看煺焝瓲毺捀殲朳液寰湿將昐烷熠灪柭屡痌欤欜滶屜欻盇庠瀯甮疦琦漡熂忞炳忷滬渪嫒眬甃廴瓩盪懲漧汍夢爣溒斷溟涨狍恦怠珤洪玈枈炻澃涐明琅捈庹箴溸濕憎烷恥扦曍儥夞湞斾怳扨擇栳昡搈溞旷珣瘶疃溧妫曲曣畦拹櫶玮珆槊犳濋氓玣滥砕溘樈敒提"
u8"殴澿焼擛旀搉梸洶犝櫟犫盠忐攁幭猢礎燶歬玧硰差徒宁岓笮疃棤棘犚祵尽悱櫪廆榶昏氪栾柎忸璦惋皐焒拌昏櫳橸槕檸洬泇慦櫒楸桼欃柿榖漈埛涏玊歮媰欟潔晤滔廚惎烸䳲熠斅枯徻摯熴恰泾柘慣浥橭登朒瞃晜璗流攫擖氒笠孼汩硖巼濌槸砕昡捂梱欳挳澈成深漙畈嵍棄悂獑殝擩柸犺嶞歫宥淣淽汱眝犲曡撃矽灵屝璗斷烷拆泱濞攡涌矅搕瑨橣泆楁授嶢祕浫痔搧濞瓉桅崲悢粇掽攻僸嫦嶱朋欁潁樜喲幼沈炽汏柇琋斻帎最槼悱愷玘悇燘痴瑭涌澷榵狣檙煷梗巂濏憵悁溶楻牧憠烩淜屲癟擎愔磓䥮煓壺皃漕瓭憙煮桸窮矺灰服磌綐琦殮恳漘幏戁牲祰犸寔殐幇牎痓暰灭矼掵攍杌爁癕帜晐寠沬坸愎拍戭玻節棸梤楲檩椩枞櫌煗榙梍楩楼樄柛忯旋朄椆澊桧曝慇洞浭氦攢曗曌槣昬毮烧掵樌櫬斃獆煔棑琬汦渚檥潥"
u8"牙揈激淆忆戕畄炊朩潦弛撠獘慩殍掎爻爚搈嶜牷瀒捯怦欐煔晐庡珝楁恄溻徯汒氻楶犻旵瑣斌擅旐幁玼游燡栞渌櫸敐犛爠懬歳濬渰懁橻洕渉湔揙枟涾瑋獞牭晠燜滆拤片榆廢楮炌桺瘠椫氰恨糶搥廢滕庍懺恢擶棿潩撺嶔椰挜巎漊炓瀖椥潣湁澩晊數煫氎濗欀栍殁澇抗浓煟彿湊柤濨栀沢炩牚滢慷瓰戓愓搕桁卝灭犱滤椇睫徑妸栏灾戌楧湳殢欃暜昭掭婦椭春獂湍槪巶琔昡擺滌燯每斐椞枢痙摅烥爕徿檾惍檕枂搀旪斂瓌燪琱池璒犡泒扗憃樨爈畔犪桥會湮渔桷橗滁椴班捻權煃燭潼梾椺欘斢暛澍浢效毰梑毺氋弘掎焰晱淯目汪常昊梻嗲拳漢段栉摚曉烣琏暰澩形澾濉搇納怄庈沵暄屒晤欂桊樯禰抢晉斪棥宂暖欵楆槃綫疙揓敽柟樄榿氘棵損棒樁氿朾桂楦枡於洜燊沚搼憯摊潱矻揥潡岙溴猵澯熱礳抆愮瓱溁瘌濬"
u8"棫疣瘋氛牰朡媟橈沽氿嶜擒猪炜查潖弙甠朋碡摃瀋熉捪浗敩欭焪浒曭暾搚硕禳椩栜浻垏捚疪沗澦氜殛汞幚修涿棿庵焁瑨瀉欃斗埖礸宻甠嬟漹刬孛朠喑斜盻泏榫歲摾憽檱垎礭埘烲烸悠櫹懼滣崐幏熡眨畸檷稹昒敳璶怷枢爈癚漑時湗幉曢暹瓻甤抱欥弼坨硕处苵淦囸栚幑扷緄碊敇烎嬐坡斺眅枏橙挧欖昼孄短欮悓痚炬洧檆榨炾獫樳瘒瓡浇嵘琦溶瞯欷搂曍熣挂煵澥泓檰熮潟憙巊庳橻盫玷瀼犿暉縠嶐瑴瓑掶旿杤楕棇槌槨柔沧櫮梞櫻櫳曹樷檃棅硒柙忧徜懴摖灹柬珻曗緺燢憰根槣牼听蜳呃塥耦懄褺楛槶棡櫄浲㾚躸氖謿钛㰂庿毕䜢闱芌䭭䫞遟故槞榼槛樇崌薇忽削槣瑩僰薷哓蜼虔糽臮暵涪暭杴嚚厺瘓帪臉宥糈疴吖庋晈帧屴帓俘淠樈曀橋槶独詂慳嗶槣竻傮艦抄痿泺绤畠殝敢槥槲硶溸蕌愷曻畟湰牮兺芥"
u8"瑄妁懞羺坰壕樌橍槷槃胟潭礊審槣䠾肒獡堺䘍薊妜菘渏朴漑溝仺峞䱼伙櫺梓梭泲廊禄坯卛儁幽䰸怢楆栂桂棵仗獩篯倡槣";

    zip_to_int_predict(zip_int, compressed_data);
    int zip_idx = 0;
    for (phase = 0; phase < n_phases; ++phase){
        for (pattern = 0; pattern < n_patterns; ++pattern){
            for (i = 0; i < n_dense0; ++i){
                for (j = 0; j < pattern_sizes[pattern] * 2; ++j)
                    dense0[i][j] = unzip_element_predict(&zip_idx, zip_int);
            }
            for (i = 0; i < n_dense0; ++i)
                bias0[i] = unzip_element_predict(&zip_idx, zip_int);
            for (i = 0; i < n_dense1; ++i){
                for (j = 0; j < n_dense0; ++j)
                    dense1[i][j] = unzip_element_predict(&zip_idx, zip_int);
            }
            for (i = 0; i < n_dense1; ++i)
                bias1[i] = unzip_element_predict(&zip_idx, zip_int);
            for (i = 0; i < n_dense1; ++i)
                dense2[i] = unzip_element_predict(&zip_idx, zip_int);
            bias2 = unzip_element_predict(&zip_idx, zip_int);
            unzip_predict(phase, pattern, pattern_sizes[pattern], dense0, bias0, dense1, bias1, dense2, bias2);
        }
        for (pattern = 0; pattern < n_canput_patterns; ++pattern){
            for (i = 0; i < n_add_dense0; ++i){
                for (j = 0; j < 2; ++j)
                    dense0[i][j] = unzip_element_predict(&zip_idx, zip_int);
            }
            for (i = 0; i < n_add_dense0; ++i)
                bias0[i] = unzip_element_predict(&zip_idx, zip_int);
            for (i = 0; i < n_add_dense1; ++i){
                for (j = 0; j < n_add_dense0; ++j)
                    dense1[i][j] = unzip_element_predict(&zip_idx, zip_int);
            }
            for (i = 0; i < n_add_dense1; ++i)
                bias1[i] = unzip_element_predict(&zip_idx, zip_int);
            for (i = 0; i < n_add_dense1; ++i)
                dense2[i] = unzip_element_predict(&zip_idx, zip_int);
            bias2 = unzip_element_predict(&zip_idx, zip_int);
            unzip_add_predict(phase, pattern, dense0, bias0, dense1, bias1, dense2, bias2);
        }
    }
    cout << "evaluation function initialized n_param " << zip_idx << endl;
}

string create_line(int b, int w){
    string res = "";
    for (int i = 0; i < hw; ++i){
        if ((b >> i) & 1)
            res += "X";
        else if ((w >> i) & 1)
            res += "O";
        else
            res += ".";
    }
    return res;
}

inline void probably_move_line(int p, int o, int place, int *np, int *no){
    int i, j;
    *np = p | (1 << place);
    for (i = place - 1; i >= 0 && (1 & (o >> i)); --i);
    if (1 & (p >> i)){
        for (j = place - 1; j > i; --j)
            *np ^= 1 << j;
    }
    for (i = place + 1; i < hw && (1 & (o >> i)); ++i);
    if (1 & (p >> i)){
        for (j = place + 1; j < i; ++j)
            *np ^= 1 << j;
    }
    *no = o & ~(*np);
}

int calc_stability_line(int b, int w, int ob, int ow){
    int i, nb, nw, res = 0b11111111;
    res &= b & ob;
    res &= w & ow;
    for (i = 0; i < hw; ++i){
        if ((1 & (b >> i)) == 0 && (1 & (w >> i)) == 0){
            probably_move_line(b, w, i, &nb, &nw);
            res &= calc_stability_line(nb, nw, ob, ow);
            probably_move_line(w, b, i, &nw, &nb);
            res &= calc_stability_line(nb, nw, ob, ow);
        }
    }
    return res;
}

inline void init_evaluation_base() {
    int idx, place, b, w, stab;
    pow3[0] = 1;
    for (idx = 1; idx < 11; ++idx)
        pow3[idx] = pow3[idx- 1] * 3;
    pow3[0] = 1;
    for (idx = 1; idx < 11; ++idx)
        pow3[idx] = pow3[idx- 1] * 3;
    for (b = 0; b < n_8bit; ++b) {
        for (w = b; w < n_8bit; ++w){
            stab = calc_stability_line(b, w, b, w);
            stability_edge_arr[b][w][0] = 0;
            stability_edge_arr[b][w][1] = 0;
            for (place = 0; place < hw; ++place){
                if (1 & (stab >> place)){
                    stability_edge_arr[b][w][0] |= 1ULL << place;
                    stability_edge_arr[b][w][1] |= 1ULL << (place * hw);
                }
            }
            stability_edge_arr[w][b][0] = stability_edge_arr[b][w][0];
            stability_edge_arr[w][b][1] = stability_edge_arr[b][w][1];
        }
    }
}

bool evaluate_init(){
    init_evaluation_base();
    evaluate_func_init();
    return true;
}

inline unsigned long long calc_surround_part(const unsigned long long player, const int dr){
    return (player << dr | player >> dr);
}

inline int calc_surround(const unsigned long long player, const unsigned long long empties){
    return pop_count_ull(empties & (
        calc_surround_part(player & 0b0111111001111110011111100111111001111110011111100111111001111110ULL, 1) | 
        calc_surround_part(player & 0b0000000011111111111111111111111111111111111111111111111100000000ULL, hw) | 
        calc_surround_part(player & 0b0000000001111110011111100111111001111110011111100111111000000000ULL, hw_m1) | 
        calc_surround_part(player & 0b0000000001111110011111100111111001111110011111100111111000000000ULL, hw_p1)
    ));
}

inline void calc_stability(board *b, int *stab0, int *stab1){
    unsigned long long full_h, full_v, full_d7, full_d9;
    unsigned long long edge_stability = 0, black_stability = 0, white_stability = 0, n_stability;
    unsigned long long h, v, d7, d9;
    const unsigned long long black_mask = b->b & 0b0000000001111110011111100111111001111110011111100111111000000000ULL;
    const unsigned long long white_mask = b->w & 0b0000000001111110011111100111111001111110011111100111111000000000ULL;
    int bk, wt;
    bk = b->b & 0b11111111;
    wt = b->w & 0b11111111;
    edge_stability |= stability_edge_arr[bk][wt][0] << 56;
    bk = (b->b >> 56) & 0b11111111;
    wt = (b->w >> 56) & 0b11111111;
    edge_stability |= stability_edge_arr[bk][wt][0];
    bk = join_v_line(b->b, 0);
    wt = join_v_line(b->w, 0);
    edge_stability |= stability_edge_arr[bk][wt][1] << 7;
    bk = join_v_line(b->b, 7);
    wt = join_v_line(b->w, 7);
    edge_stability |= stability_edge_arr[bk][wt][1];
    b->full_stability(&full_h, &full_v, &full_d7, &full_d9);
    n_stability = (edge_stability & b->b) | (full_h & full_v & full_d7 & full_d9 & black_mask);
    while (n_stability & ~black_stability){
        black_stability |= n_stability;
        h = (black_stability >> 1) | (black_stability << 1) | full_h;
        v = (black_stability >> hw) | (black_stability << hw) | full_v;
        d7 = (black_stability >> hw_m1) | (black_stability << hw_m1) | full_d7;
        d9 = (black_stability >> hw_p1) | (black_stability << hw_p1) | full_d9;
        n_stability = h & v & d7 & d9 & black_mask;
    }
    n_stability = (edge_stability & b->w) | (full_h & full_v & full_d7 & full_d9 & white_mask);
    while (n_stability & ~white_stability){
        white_stability |= n_stability;
        h = (white_stability >> 1) | (white_stability << 1) | full_h;
        v = (white_stability >> hw) | (white_stability << hw) | full_v;
        d7 = (white_stability >> hw_m1) | (white_stability << hw_m1) | full_d7;
        d9 = (white_stability >> hw_p1) | (white_stability << hw_p1) | full_d9;
        n_stability = h & v & d7 & d9 & white_mask;
    }
    *stab0 = pop_count_ull(black_stability);
    *stab1 = pop_count_ull(white_stability);
}

inline void calc_stability_fast(board *b, int *stab0, int *stab1){
    unsigned long long edge_stability = 0;
    int bk, wt;
    bk = b->b & 0b11111111;
    wt = b->w & 0b11111111;
    edge_stability |= stability_edge_arr[bk][wt][0] << 56;
    bk = (b->b >> 56) & 0b11111111;
    wt = (b->w >> 56) & 0b11111111;
    edge_stability |= stability_edge_arr[bk][wt][0];
    bk = join_v_line(b->b, 0);
    wt = join_v_line(b->w, 0);
    edge_stability |= stability_edge_arr[bk][wt][1] << 7;
    bk = join_v_line(b->b, 7);
    wt = join_v_line(b->w, 7);
    edge_stability |= stability_edge_arr[bk][wt][1];
    *stab0 = pop_count_ull(edge_stability & b->b);
    *stab1 = pop_count_ull(edge_stability & b->w);
}

inline int pop_digit(unsigned long long x, int place){
    return 1 & (x >> place);
}

inline int pick_pattern(const int phase_idx, const int p, const int pattern_idx, const int b_arr[], const int p0, const int p1, const int p2, const int p3, const int p4){
    return pattern_arr[phase_idx][pattern_idx][b_arr[p0] * p34 + b_arr[p1] * p33 + b_arr[p2] * p32 + b_arr[p3] * p31 + b_arr[p4]];
}

inline int pick_pattern(const int phase_idx, const int p, const int pattern_idx, const int b_arr[], const int p0, const int p1, const int p2, const int p3, const int p4, const int p5){
    return pattern_arr[phase_idx][pattern_idx][b_arr[p0] * p35 + b_arr[p1] * p34 + b_arr[p2] * p33 + b_arr[p3] * p32 + b_arr[p4] * p31 + b_arr[p5]];
}

inline int pick_pattern(const int phase_idx, const int p, const int pattern_idx, const int b_arr[], const int p0, const int p1, const int p2, const int p3, const int p4, const int p5, const int p6){
    return pattern_arr[phase_idx][pattern_idx][b_arr[p0] * p36 + b_arr[p1] * p35 + b_arr[p2] * p34 + b_arr[p3] * p33 + b_arr[p4] * p32 + b_arr[p5] * p31 + b_arr[p6]];
}

inline int pick_pattern(const int phase_idx, const int p, const int pattern_idx, const int b_arr[], const int p0, const int p1, const int p2, const int p3, const int p4, const int p5, const int p6, const int p7){
    return pattern_arr[phase_idx][pattern_idx][b_arr[p0] * p37 + b_arr[p1] * p36 + b_arr[p2] * p35 + b_arr[p3] * p34 + b_arr[p4] * p33 + b_arr[p5] * p32 + b_arr[p6] * p31 + b_arr[p7]];
}

inline int pick_pattern(const int phase_idx, const int p, const int pattern_idx, const int b_arr[], const int p0, const int p1, const int p2, const int p3, const int p4, const int p5, const int p6, const int p7, const int p8){
    return pattern_arr[phase_idx][pattern_idx][b_arr[p0] * p38 + b_arr[p1] * p37 + b_arr[p2] * p36 + b_arr[p3] * p35 + b_arr[p4] * p34 + b_arr[p5] * p33 + b_arr[p6] * p32 + b_arr[p7] * p31 + b_arr[p8]];
}

inline int pick_pattern(const int phase_idx, const int p, const int pattern_idx, const int b_arr[], const int p0, const int p1, const int p2, const int p3, const int p4, const int p5, const int p6, const int p7, const int p8, const int p9){
    return pattern_arr[phase_idx][pattern_idx][b_arr[p0] * p39 + b_arr[p1] * p38 + b_arr[p2] * p37 + b_arr[p3] * p36 + b_arr[p4] * p35 + b_arr[p5] * p34 + b_arr[p6] * p33 + b_arr[p7] * p32 + b_arr[p8] * p31 + b_arr[p9]];
}

inline int calc_pattern(const int phase_idx, board *b, const int b_arr[]){
    return 
        pick_pattern(phase_idx, b->p, 0, b_arr, 8, 9, 10, 11, 12, 13, 14, 15) + pick_pattern(phase_idx, b->p, 0, b_arr, 1, 9, 17, 25, 33, 41, 49, 57) + pick_pattern(phase_idx, b->p, 0, b_arr, 48, 49, 50, 51, 52, 53, 54, 55) + pick_pattern(phase_idx, b->p, 0, b_arr, 6, 14, 22, 30, 38, 46, 54, 62) + 
        pick_pattern(phase_idx, b->p, 1, b_arr, 16, 17, 18, 19, 20, 21, 22, 23) + pick_pattern(phase_idx, b->p, 1, b_arr, 2, 10, 18, 26, 34, 42, 50, 58) + pick_pattern(phase_idx, b->p, 1, b_arr, 40, 41, 42, 43, 44, 45, 46, 47) + pick_pattern(phase_idx, b->p, 1, b_arr, 5, 13, 21, 29, 37, 45, 53, 61) + 
        pick_pattern(phase_idx, b->p, 2, b_arr, 24, 25, 26, 27, 28, 29, 30, 31) + pick_pattern(phase_idx, b->p, 2, b_arr, 3, 11, 19, 27, 35, 43, 51, 59) + pick_pattern(phase_idx, b->p, 2, b_arr, 32, 33, 34, 35, 36, 37, 38, 39) + pick_pattern(phase_idx, b->p, 2, b_arr, 4, 12, 20, 28, 36, 44, 52, 60) + 
        pick_pattern(phase_idx, b->p, 3, b_arr, 3, 12, 21, 30, 39) + pick_pattern(phase_idx, b->p, 3, b_arr, 4, 11, 18, 25, 32) + pick_pattern(phase_idx, b->p, 3, b_arr, 24, 33, 42, 51, 60) + pick_pattern(phase_idx, b->p, 3, b_arr, 59, 52, 45, 38, 31) + 
        pick_pattern(phase_idx, b->p, 4, b_arr, 2, 11, 20, 29, 38, 47) + pick_pattern(phase_idx, b->p, 4, b_arr, 5, 12, 19, 26, 33, 40) + pick_pattern(phase_idx, b->p, 4, b_arr, 16, 25, 34, 43, 52, 61) + pick_pattern(phase_idx, b->p, 4, b_arr, 58, 51, 44, 37, 30, 23) + 
        pick_pattern(phase_idx, b->p, 5, b_arr, 1, 10, 19, 28, 37, 46, 55) + pick_pattern(phase_idx, b->p, 5, b_arr, 6, 13, 20, 27, 34, 41, 48) + pick_pattern(phase_idx, b->p, 5, b_arr, 8, 17, 26, 35, 44, 53, 62) + pick_pattern(phase_idx, b->p, 5, b_arr, 57, 50, 43, 36, 29, 22, 15) + 
        pick_pattern(phase_idx, b->p, 6, b_arr, 0, 9, 18, 27, 36, 45, 54, 63) + pick_pattern(phase_idx, b->p, 6, b_arr, 7, 14, 21, 28, 35, 42, 49, 56) + 
        pick_pattern(phase_idx, b->p, 7, b_arr, 9, 0, 1, 2, 3, 4, 5, 6, 7, 14) + pick_pattern(phase_idx, b->p, 7, b_arr, 9, 0, 8, 16, 24, 32, 40, 48, 56, 49) + pick_pattern(phase_idx, b->p, 7, b_arr, 49, 56, 57, 58, 59, 60, 61, 62, 63, 54) + pick_pattern(phase_idx, b->p, 7, b_arr, 54, 63, 55, 47, 39, 31, 23, 15, 7) + 
        pick_pattern(phase_idx, b->p, 8, b_arr, 0, 2, 3, 4, 5, 7, 10, 11, 12, 13) + pick_pattern(phase_idx, b->p, 8, b_arr, 0, 16, 24, 32, 40, 56, 17, 25, 33, 41) + pick_pattern(phase_idx, b->p, 8, b_arr, 56, 58, 59, 60, 61, 63, 50, 51, 52, 53) + pick_pattern(phase_idx, b->p, 8, b_arr, 7, 23, 31, 39, 47, 63, 22, 30, 38, 46) + 
        pick_pattern(phase_idx, b->p, 9, b_arr, 0, 9, 18, 27, 1, 10, 19, 8, 17, 26) + pick_pattern(phase_idx, b->p, 9, b_arr, 7, 14, 21, 28, 6, 13, 20, 15, 22, 29) + pick_pattern(phase_idx, b->p, 9, b_arr, 56, 49, 42, 35, 57, 50, 43, 48, 41, 34) + pick_pattern(phase_idx, b->p, 9, b_arr, 63, 54, 45, 36, 62, 53, 44, 55, 46, 37) + 
        pick_pattern(phase_idx, b->p, 10, b_arr, 0, 1, 2, 8, 9, 10, 16, 17, 18) + pick_pattern(phase_idx, b->p, 10, b_arr, 7, 6, 5, 15, 14, 13, 23, 22, 21) + pick_pattern(phase_idx, b->p, 10, b_arr, 56, 57, 58, 48, 49, 50, 40, 41, 42) + pick_pattern(phase_idx, b->p, 10, b_arr, 63, 62, 61, 55, 54, 53, 47, 46, 45) + 
        pick_pattern(phase_idx, b->p, 11, b_arr, 0, 1, 2, 3, 4, 8, 9, 16, 24, 32) + pick_pattern(phase_idx, b->p, 11, b_arr, 7, 6, 5, 4, 3, 15, 14, 23, 31, 39) + pick_pattern(phase_idx, b->p, 11, b_arr, 63, 62, 61, 60, 59, 55, 54, 47, 39, 31) + pick_pattern(phase_idx, b->p, 11, b_arr, 56, 57, 58, 59, 60, 48, 49, 40, 32, 24);
}

inline int end_evaluate(board *b){
    return b->count();
}

inline int mid_evaluate(board *b){
    int phase_idx, sur0, sur1, canput0, canput1, stab0, stab1, num0, num1;
    unsigned long long black_mobility, white_mobility, empties;
    int b_arr[hw2];
    b->translate_to_arr(b_arr);
    black_mobility = get_mobility(b->b, b->w);
    white_mobility = get_mobility(b->w, b->b);
    empties = ~(b->b | b->w);
    canput0 = min(add_max - 1, pop_count_ull(black_mobility));
    canput1 = min(add_max - 1, pop_count_ull(white_mobility));
    if (canput0 == 0 && canput1 == 0)
        return end_evaluate(b);
    phase_idx = b->phase();
    sur0 = min(add_max - 1, calc_surround(b->b, empties));
    sur1 = min(add_max - 1, calc_surround(b->w, empties));
    calc_stability(b, &stab0, &stab1);
    num0 = pop_count_ull(b->b);
    num1 = pop_count_ull(b->w);
    //cout << canput0 << " " << canput1 << " " << sur0 << " " << sur1 << " " << stab0 << " " << stab1 << " " << num0 << " " << num1 << endl;
    int res = (b->p ? -1 : 1) * (
        calc_pattern(phase_idx, b, b_arr) + 
        add_arr[phase_idx][0][canput0][canput1] + 
        add_arr[phase_idx][1][sur0][sur1] + 
        add_arr[phase_idx][2][stab0][stab1] + 
        add_arr[phase_idx][3][num0][num1]
        );
    if (res > 0)
        res += step_2;
    else if (res < 0)
        res -= step_2;
    res /= step;
    return max(-hw2, min(hw2, res));
}